[
  {
    "url": "https://www.allrecipes.com/recipe/258817/chicken-pasta-with-artichoke-hearts/",
    "name": "Chicken Pasta with Artichoke Hearts",
    "prep": "15 Mins",
    "cook": "33 Mins",
    "ready in": "48 Mins",
    "servings": "4 servings",
    "ingredients": [
      "2 cups penne pasta",
      "1 (6 ounce) jar marinated artichokes, coarsely chopped, marinade reserved",
      "3 skinless, boneless chicken breasts, cut into bite-sized pieces",
      "3 cups sliced fresh mushrooms",
      "¾ cup reduced-fat low-sodium chicken broth",
      "½ cup dry white wine",
      "1 tablespoon cornstarch",
      "salt and ground black pepper to taste"
    ],
    "directions": [
      "Bring a large pot of lightly salted water to a boil; add penne and cook, stirring occasionally, until tender yet firm to the bite, about 11 minutes. Drain.\n",
      "Pour artichoke marinade into a large nonstick skillet over medium heat. Add chicken; cook and stir until white, about 3 minutes. Add mushrooms; cook and stir until chicken is no longer pink in the center, 4 to 6 minutes. Stir in artichokes.\n",
      "Mix chicken broth, white wine, and cornstarch together in a bowl until cornstarch is dissolved. Pour into the skillet slowly, stirring constantly until sauce comes to a boil. Reduce heat and simmer until thickened, about 5 minutes.\n",
      "Toss chicken mixture with penne in a large bowl. Season with salt and pepper.\n"
    ],
    "calories": 301,
    "carb": 36,
    "protein": 25,
    "fat": 6
  },
  {
    "url": "https://www.allrecipes.com/recipe/8918/easy-garlic-chicken/",
    "name": "Easy Garlic Chicken",
    "prep": "n/a",
    "cook": "n/a",
    "ready in": "n/a",
    "servings": "4 servings",
    "ingredients": [
      "1 ½ pounds skinless, boneless chicken breast halves",
      "¼ cup butter",
      "6 cloves crushed garlic",
      "2 cups seasoned dry bread crumbs"
    ],
    "directions": [
      "Preheat oven to 375 degrees F (190 degrees C).\n",
      "In a small saucepan melt butter/margarine with garlic. Dip chicken pieces in butter/garlic sauce, letting extra drip off, then coat completely with bread crumbs.\n",
      "Place coated chicken in a lightly greased 9x13 inch baking dish. Combine any leftover butter/garlic sauce with bread crumbs and spoon mixture over chicken pieces. Bake in the preheated oven for 45 minutes to 1 hour.\n"
    ],
    "calories": 510,
    "carb": 41,
    "protein": 47,
    "fat": 17
  },
  {
    "url": "https://www.allrecipes.com/recipe/31096/easy-caramelized-onion-pork-chops/",
    "name": "Easy Caramelized Onion Pork Chops",
    "prep": "5 Mins",
    "cook": "40 Mins",
    "ready in": "45 Mins",
    "servings": "4 servings",
    "ingredients": [
      "1 tablespoon vegetable oil",
      "4 (4 ounce) pork loin chops, 1/2 inch thick",
      "3 teaspoons seasoning salt",
      "2 teaspoons ground black pepper",
      "1 onion, cut into strips",
      "1 cup water"
    ],
    "directions": [
      "Rub chops with 2 teaspoons seasoning salt and 1 teaspoon pepper, or to taste.\n",
      "In a skillet, heat oil over medium heat.  Brown pork chops on each side.  Add the onions and water to the pan. Cover, reduce heat, and simmer for 20 minutes.\n",
      "Turn chops over, and add remaining salt and pepper. Cover, and cook until water evaporates and onions turn light to medium brown.  Remove chops from pan, and serve with onions on top.\n"
    ],
    "calories": 48,
    "carb": 4,
    "protein": 1,
    "fat": 4
  },
  {
    "url": "https://www.allrecipes.com/recipe/12745/mexican-baked-fish/",
    "name": "Mexican Baked Fish",
    "prep": "15 Mins",
    "cook": "15 Mins",
    "ready in": "30 Mins",
    "servings": "6 servings",
    "ingredients": [
      "1 ½ pounds cod",
      "1 cup salsa",
      "1 cup shredded sharp Cheddar cheese",
      "½ cup coarsely crushed corn chips",
      "1 avocado - peeled, pitted and sliced",
      "¼ cup sour cream"
    ],
    "directions": [
      "Preheat oven to 400 degrees F (200 degrees C). Lightly grease one 8x12 inch baking dish.\n",
      "Rinse fish fillets under cold water, and pat dry with paper towels. Lay fillets side by side in the prepared baking dish. Pour the salsa over the top, and sprinkle evenly with the shredded cheese. Top with the crushed corn chips.\n",
      "Bake, uncovered, in the preheated oven for 15 minutes, or until fish is opaque and flakes with a fork. Serve topped with sliced avocado and sour cream.\n"
    ],
    "calories": 311,
    "carb": 12,
    "protein": 28,
    "fat": 18
  },
  {
    "url": "https://www.allrecipes.com/recipe/257165/thai-style-turkey-burgers/",
    "name": "Thai-Style Turkey Burgers",
    "prep": "15 Mins",
    "cook": "15 Mins",
    "ready in": "30 Mins",
    "servings": "4 burgers",
    "ingredients": [
      "1 egg, beaten",
      "2 tablespoons soy sauce",
      "⅓ cup minced fresh cilantro",
      "2 green onions, thinly sliced",
      "1 ½ tablespoons minced fresh ginger, or more to taste",
      "2 cloves garlic, minced",
      "1 pinch salt and ground black pepper to taste",
      "1 pound lean ground turkey",
      "⅓ cup bread crumbs"
    ],
    "directions": [
      "Whisk egg and soy sauce together in a bowl; add cilantro, green onions, ginger, garlic, salt, and pepper. Mix turkey and bread crumbs into mixture and mix well; form into 4 patties.\n",
      "Heat a large non-stick skillet over medium heat. Place patties in the hot skillet; cover skillet and cook, turning once, until burgers are no longer pink in the center, about 15 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).\n"
    ],
    "calories": 236,
    "carb": 9,
    "protein": 25,
    "fat": 12
  },
  {
    "url": "https://www.allrecipes.com/recipe/257865/easy-chorizo-street-tacos/",
    "name": "Easy Chorizo Street Tacos",
    "prep": "10 Mins",
    "cook": "7 Mins",
    "ready in": "17 Mins",
    "servings": "2 tacos",
    "ingredients": [
      "1 chorizo sausage link, casing removed and meat crumbled",
      "2 tablespoons chipotle peppers in adobo sauce",
      "4 corn tortillas",
      "2 tablespoons chopped onion, or to taste",
      "2 tablespoons chopped fresh cilantro, or to taste"
    ],
    "directions": [
      "Mix chorizo and chipotle peppers in adobo sauce together in a bowl.\n",
      "Heat a skillet over medium-high heat; add chorizo mixture and cook until crisp, 5 to 7 minutes. Transfer chorizo to a plate, reserving grease in the skillet.\n",
      "Heat tortillas in the reserved grease in skillet over medium heat until warmed, 1 to 2 minutes per side. Stack 2 tortillas on top of each other for each taco. Fill with chorizo, onion, and cilantro.\n"
    ],
    "calories": 262,
    "carb": 26,
    "protein": 11,
    "fat": 14
  },
  {
    "url": "https://www.allrecipes.com/recipe/254874/roasted-cherry-tomatoes-with-angel-hair/",
    "name": "Roasted Cherry Tomatoes with Angel Hair",
    "prep": "20 Mins",
    "cook": "39 Mins",
    "ready in": "59 Mins",
    "servings": "2 servings",
    "ingredients": [
      "1 (10 ounce) basket cherry tomatoes, halved",
      "1 tablespoon olive oil",
      "1 teaspoon minced garlic",
      "salt and ground black pepper to taste",
      "4 ounces angel hair pasta",
      "3 basil leaves, cut into thin strips, or more to taste",
      "1 dash red pepper flakes",
      "2 tablespoons fresh grated Parmesan cheese, or to taste"
    ],
    "directions": [
      "Preheat oven to 375 degrees F (190 degrees C).\n",
      "Combine tomatoes, olive oil, garlic, salt, and pepper in a bowl until well mixed; spread on a shallow-sided baking sheet.\n",
      "Bake in the preheated oven until tomatoes are soft and wrinkled, 25 to 30 minutes.\n",
      "Bring a large pot of lightly salted water to a boil. Cook angel hair pasta in the boiling water, stirring occasionally until tender yet firm to the bite, 4 to 5 minutes. Drain; reserving a small amount of cooking water.\n",
      "Spoon tomatoes with their juices into a small saucepan; add basil and red pepper flakes. Mix in reserved cooking water to thin tomato mixture to desired consistency. Cook and stir over low heat until warmed, about 5 minutes; stir in pasta. Top with Parmesan cheese before serving.\n"
    ],
    "calories": 288,
    "carb": 40,
    "protein": 12,
    "fat": 11
  },
  {
    "url": "https://www.allrecipes.com/recipe/246628/spaghetti-cacio-e-pepe/",
    "name": "Spaghetti Cacio e Pepe",
    "prep": "5 Mins",
    "cook": "18 Mins",
    "ready in": "23 Mins",
    "servings": "4 servings",
    "ingredients": [
      "1 pound spaghetti",
      "6 tablespoons olive oil",
      "2 cloves garlic, minced",
      "2 teaspoons ground black pepper",
      "1 ¾ cups grated Pecorino Romano cheese"
    ],
    "directions": [
      "Bring a large pot of lightly salted water to a boil. Cook spaghetti in the boiling water, stirring occasionally until tender yet firm to the bite, about 10 minutes. Scoop out some of the cooking water and reserve. Drain spaghetti.\n",
      "Heat oil in a large skillet over medium heat. Add garlic and pepper; cook and stir until fragrant, 1 to 2 minutes. Add spaghetti and Pecorino Romano cheese. Ladle in 1/2 cup of reserved cooking water; stir until cheese is melted, about 1 minute. Add more cooking water until sauce coats spaghetti, about 1 minute more.\n"
    ],
    "calories": 807,
    "carb": 88,
    "protein": 32,
    "fat": 36
  },
  {
    "url": "https://www.allrecipes.com/recipe/24509/grandmas-famous-salmon-cakes/",
    "name": "Grandma's Famous Salmon Cakes",
    "prep": "10 Mins",
    "cook": "20 Mins",
    "ready in": "30 Mins",
    "servings": "4 servings",
    "ingredients": [
      "1 (14.75 ounce) can salmon, drained and flaked",
      "2 eggs, beaten",
      "1 small onion, diced",
      "1 teaspoon ground black pepper",
      "3 tablespoons vegetable oil"
    ],
    "directions": [
      "Pick through the salmon and remove any bones. In a mixing bowl, beat the eggs and add the diced onion, salmon and pepper. Mix thoroughly.\n",
      "Shape into 2 ounce patties; about 7 or 8 patties. In a large skillet over medium heat, heat the oil. Fry each patty for 5 minutes on each side or until crispy and golden brown.\n"
    ],
    "calories": 307,
    "carb": 3,
    "protein": 28,
    "fat": 21
  },
  {
    "url": "https://www.allrecipes.com/recipe/23891/grilled-cheese-sandwich/",
    "name": "Grilled Cheese Sandwich",
    "prep": "5 Mins",
    "cook": "15 Mins",
    "ready in": "20 Mins",
    "servings": "2 servings",
    "ingredients": [
      "4 slices white bread",
      "3 tablespoons butter, divided",
      "2 slices Cheddar cheese"
    ],
    "directions": [
      "Preheat skillet over medium heat. Generously butter one side of a slice of bread. Place bread butter-side-down onto skillet bottom and add 1 slice of cheese. Butter a second slice of bread on one side and place butter-side-up on top of sandwich. Grill until lightly browned and flip over; continue grilling until cheese is melted. Repeat with remaining 2 slices of bread, butter and slice of cheese.\n"
    ],
    "calories": 400,
    "carb": 26,
    "protein": 12,
    "fat": 29
  },
  {
    "url": "https://www.allrecipes.com/recipe/218894/easy-swedish-meatball-sauce/",
    "name": "Easy Swedish Meatball Sauce",
    "prep": "5 Mins",
    "cook": "15 Mins",
    "ready in": "20 Mins",
    "servings": "4 servings",
    "ingredients": [
      "1 cup beef stock",
      "1 cup heavy cream",
      "3 tablespoons all-purpose flour",
      "1 tablespoon soy sauce",
      "1 teaspoon ground black pepper",
      "½ teaspoon dried rosemary",
      "½ (20 ounce) package frozen cooked meatballs, thawed"
    ],
    "directions": [
      "Whisk together the beef stock, heavy cream, flour, soy sauce, black pepper, and rosemary in a large saucepan until smooth. Cook and stir over low heat until thickened, about 10 minutes, stirring occasionally. Stir in the meatballs, and continue cooking until meatballs are heated through, about 5 more minutes.\n"
    ],
    "calories": 393,
    "carb": 13,
    "protein": 15,
    "fat": 32
  },
  {
    "url": "https://www.allrecipes.com/recipe/220716/haluski-cabbage-and-noodles/",
    "name": "Haluski - Cabbage and Noodles",
    "prep": "15 Mins",
    "cook": "45 Mins",
    "ready in": "60 Mins",
    "servings": "12 servings",
    "ingredients": [
      "1 (16 ounce) package medium-wide egg noodles",
      "1 cup butter, divided",
      "2 large onions, chopped",
      "2 small heads cabbage, cored and cut into 1-inch pieces",
      "salt and ground black pepper to taste",
      "1 tablespoon water, or as needed"
    ],
    "directions": [
      "Preheat oven to 300 degrees F (150 degrees C).\n",
      "Fill a large pot with lightly salted water and bring to a rolling boil. Stir in egg noodles and return to a boil. Cook noodles uncovered, stirring occasionally, until tender but still slightly firm, about 5 minutes. Drain well.\n",
      "Melt 1/2 cup butter in a large skillet over medium-low heat; cook and stir onions until translucent, 5 to 10 minutes.\n",
      "Cook and stir remaining butter and cabbage into onions until cabbage is softened but not browned, 5 to 8 more minutes. Season with salt and black pepper.\n",
      "Place cooked noodles and cabbage mixture in a large roasting pan and stir gently to combine. Sprinkle with more salt and black pepper if desired.\n",
      "Bake in the preheated oven until golden brown on top, 30 to 40 minutes.\n"
    ],
    "calories": 319,
    "carb": 36,
    "protein": 8,
    "fat": 18
  },
  {
    "url": "https://www.allrecipes.com/recipe/240955/eggplant-pasta/",
    "name": "Eggplant Pasta",
    "prep": "15 Mins",
    "cook": "40 Mins",
    "ready in": "55 Mins",
    "servings": "8 servings",
    "ingredients": [
      "¼ cup olive oil",
      "2 cloves garlic, minced",
      "1 eggplant, peeled and cut into 1/2-inch cubes",
      "1 (28 ounce) can plum tomatoes with juice, chopped",
      "1 (16 ounce) package rigatoni pasta"
    ],
    "directions": [
      "Heat olive oil in a large skillet over medium heat; cook and stir garlic until fragrant, 1 to 2 minutes. Add eggplant; cook, stirring constantly, until eggplant is softened, about 5 minutes. Add tomatoes and juice; cook until sauce is slightly reduced, about 20 minutes.\n",
      "Bring a large pot of lightly salted water to a boil. Cook rigatoni in the boiling water, stirring occasionally until cooked through but firm to the bite, about 13 minutes. Drain and transfer to a serving bowl.\n",
      "Pour sauce over pasta.\n"
    ],
    "calories": 295,
    "carb": 49,
    "protein": 9,
    "fat": 9
  },
  {
    "url": "https://www.allrecipes.com/recipe/228319/perfect-ten-baked-cod/",
    "name": "Perfect Ten Baked Cod",
    "prep": "10 Mins",
    "cook": "25 Mins",
    "ready in": "35 Mins",
    "servings": "4 servings",
    "ingredients": [
      "2 tablespoons butter",
      "½ sleeve buttery round crackers (such as Ritz®), crushed",
      "2 tablespoons butter",
      "1 pound thick-cut cod loin",
      "½ lemon, juiced",
      "¼ cup dry white wine",
      "1 tablespoon chopped fresh parsley",
      "1 tablespoon chopped green onion",
      "1 lemon, cut into wedges"
    ],
    "directions": [
      "Preheat oven to 400 degrees F (200 degrees C).\n",
      "Place 2 tablespoons butter in a microwave-safe bowl; melt in microwave on high, about 30 seconds. Stir buttery round crackers into melted butter.\n",
      "Place remaining 2 tablespoons butter in a 7x11-inch baking dish. Melt in the preheated oven, 1 to 3 minutes. Remove dish from oven.\n",
      "Coat both sides of cod in melted butter in the baking dish.\n",
      "Bake cod in the preheated oven for 10 minutes. Remove from oven; top with lemon juice, wine, and cracker mixture. Place back in oven and bake until fish is opaque and flakes easily with a fork, about 10 more minutes.\n",
      "Garnish baked cod with parsley and green onion. Serve with lemon wedges.\n"
    ],
    "calories": 280,
    "carb": 10,
    "protein": 21,
    "fat": 17
  },
  {
    "url": "https://www.allrecipes.com/recipe/78370/hamburger-steak-with-onions-and-gravy/",
    "name": "Hamburger Steak with Onions and Gravy",
    "prep": "15 Mins",
    "cook": "25 Mins",
    "ready in": "40 Mins",
    "servings": "4 servings",
    "ingredients": [
      "1 pound ground beef",
      "1 egg",
      "¼ cup bread crumbs",
      "⅛ teaspoon ground black pepper",
      "½ teaspoon seasoned salt",
      "½ teaspoon onion powder",
      "½ teaspoon garlic powder",
      "1 teaspoon Worcestershire sauce",
      "1 tablespoon vegetable oil",
      "1 cup thinly sliced onion",
      "2 tablespoons all-purpose flour",
      "1 cup beef broth",
      "1 tablespoon cooking sherry",
      "½ teaspoon seasoned salt"
    ],
    "directions": [
      "In a large bowl, mix together the ground beef, egg, bread crumbs, pepper, salt, onion powder, garlic powder, and Worcestershire sauce. Form into 8 balls, and flatten into patties.\n",
      "Heat the oil in a large skillet over medium heat. Fry the patties and onion in the oil until patties are nicely browned, about 4 minutes per side. Remove the beef patties to a plate, and keep warm.\n",
      "Sprinkle flour over the onions and drippings in the skillet. Stir in flour with a fork, scraping bits of beef off of the bottom as you stir. Gradually mix in the beef broth and sherry. Season with seasoned salt. Simmer and stir over medium-low heat for about 5 minutes, until the gravy thickens. Turn heat to low, return patties to the gravy, cover, and simmer for another 15 minutes.\n"
    ],
    "calories": 319,
    "carb": 14,
    "protein": 24,
    "fat": 19
  },
  {
    "url": "https://www.allrecipes.com/recipe/228823/quick-beef-stir-fry/",
    "name": "Quick Beef Stir-Fry",
    "prep": "15 Mins",
    "cook": "10 Mins",
    "ready in": "25 Mins",
    "servings": "4 servings",
    "ingredients": [
      "2 tablespoons vegetable oil",
      "1 pound beef sirloin, cut into 2-inch strips",
      "1 ½ cups fresh broccoli florets",
      "1 red bell pepper, cut into matchsticks",
      "2 carrots, thinly sliced",
      "1 green onion, chopped",
      "1 teaspoon minced garlic",
      "2 tablespoons soy sauce",
      "2 tablespoons sesame seeds, toasted"
    ],
    "directions": [
      "Heat vegetable oil in a large wok or skillet over medium-high heat; cook and stir beef until browned, 3 to 4 minutes. Move beef to the side of the wok and add broccoli, bell pepper, carrots, green onion, and garlic to the center of the wok. Cook and stir vegetables for 2 minutes.\n",
      "Stir beef into vegetables and season with soy sauce and sesame seeds. Continue to cook and stir until vegetables are tender, about 2 more minutes.\n"
    ],
    "calories": 268,
    "carb": 10,
    "protein": 23,
    "fat": 16
  },
  {
    "url": "https://www.allrecipes.com/recipe/6900/dumplings/",
    "name": "Dumplings",
    "prep": "5 Mins",
    "cook": "15 Mins",
    "ready in": "20 Mins",
    "servings": "6 dumplings",
    "ingredients": [
      "1 cup all-purpose flour",
      "2 teaspoons baking powder",
      "1 teaspoon white sugar",
      "½ teaspoon salt",
      "1 tablespoon margarine",
      "½ cup milk"
    ],
    "directions": [
      "Stir together flour, baking powder, sugar, and salt in medium size bowl. Cut in butter until crumbly. Stir in milk to make a soft dough.\n",
      "Drop by spoonfuls into boiling stew. Cover and simmer 15 minutes without lifting lid. Serve.\n",
      "To make parsley dumplings, add 1 tablespoon parsley flakes to the dry ingredients.\n"
    ],
    "calories": 106,
    "carb": 18,
    "protein": 3,
    "fat": 3
  },
  {
    "url": "https://www.allrecipes.com/recipe/268091/easy-korean-ground-beef-bowl/",
    "name": "Easy Korean Ground Beef Bowl",
    "prep": "10 Mins",
    "cook": "15 Mins",
    "ready in": "25 Mins",
    "servings": "4 bowls",
    "ingredients": [
      "1 pound lean ground beef",
      "5 cloves garlic, crushed",
      "1 tablespoon freshly grated ginger",
      "2 teaspoons toasted sesame oil",
      "½ cup reduced-sodium soy sauce",
      "⅓ cup light brown sugar",
      "¼ teaspoon crushed red pepper",
      "6 green onions, chopped, divided",
      "4 cups hot cooked brown rice",
      "1 tablespoon toasted sesame seeds"
    ],
    "directions": [
      "Heat a large skillet over medium-high heat. Add beef and cook, stirring and crumbling into small pieces until browned, 5 to 7 minutes. Drain excess grease.\n",
      "Add garlic, ginger, and sesame oil, stirring until fragrant, about 2 minutes. Stir in soy sauce, brown sugar, and red pepper. Cook until some of the sauce absorbs into the beef, about 7 minutes. Add 1/2 of the chopped green onions.\n",
      "Serve beef over hot cooked rice; garnished with sesame seeds and remaining green onions.\n"
    ],
    "calories": 574,
    "carb": 71,
    "protein": 29,
    "fat": 20
  },
  {
    "url": "https://www.allrecipes.com/recipe/160099/seared-ahi-tuna-steaks/",
    "name": "Seared Ahi Tuna Steaks",
    "prep": "5 Mins",
    "cook": "12 Mins",
    "ready in": "17 Mins",
    "servings": "2 servings",
    "ingredients": [
      "2 (5 ounce) ahi tuna steaks",
      "1 teaspoon kosher salt",
      "¼ teaspoon cayenne pepper",
      "½ tablespoon butter",
      "2 tablespoons olive oil",
      "1 teaspoon whole peppercorns"
    ],
    "directions": [
      "Season the tuna steaks with salt and cayenne pepper.\n",
      "Melt the butter with the olive oil in a skillet over medium-high heat. Cook the peppercorns in the mixture until they soften and pop, about 5 minutes. Gently place the seasoned tuna in the skillet and cook to desired doneness, 1 1/2 minutes per side for rare.\n"
    ],
    "calories": 301,
    "carb": 1,
    "protein": 34,
    "fat": 18
  },
  {
    "url": "https://www.allrecipes.com/recipe/47717/reuben-sandwich-ii/",
    "name": "Reuben Sandwich II",
    "prep": "15 Mins",
    "cook": "10 Mins",
    "ready in": "25 Mins",
    "servings": "4 sandwiches",
    "ingredients": [
      "2 tablespoons butter",
      "8 slices rye bread",
      "8 slices deli sliced corned beef",
      "8 slices Swiss cheese",
      "1 cup sauerkraut, drained",
      "½ cup Thousand Island dressing"
    ],
    "directions": [
      "Preheat a large skillet or griddle on medium heat.\n",
      "Lightly butter one side of bread slices. Spread non-buttered sides with Thousand Island dressing. On 4 bread slices, layer 1 slice Swiss cheese, 2 slices corned beef, 1/4 cup sauerkraut and second slice of Swiss cheese. Top with remaining bread slices, buttered sides out.\n",
      "Grill sandwiches until both sides are golden brown, about 5 minutes per side. Serve hot.\n"
    ],
    "calories": 657,
    "carb": 44,
    "protein": 33,
    "fat": 41
  },
  {
    "url": "https://www.allrecipes.com/recipe/268494/basic-air-fryer-hot-dogs/",
    "name": "Basic Air Fryer Hot Dogs",
    "prep": "5 Mins",
    "cook": "5 Mins",
    "ready in": "10 Mins",
    "servings": "4 servings",
    "ingredients": [
      "4 hot dog buns",
      "4 hot dogs"
    ],
    "directions": [
      "Preheat air fryer to 390 degrees F (200 degrees C).\n",
      "Place buns in the basket of the air fryer and cook for 2 minutes. Remove buns to a plate.\n",
      "Place hot dogs in the basket of the air fryer and cook for 3 minutes. Transfer hot dogs to buns.\n"
    ],
    "calories": 269,
    "carb": 24,
    "protein": 10,
    "fat": 16
  },
  {
    "url": "https://www.allrecipes.com/recipe/49404/juiciest-hamburgers-ever/",
    "name": "Juiciest Hamburgers Ever",
    "prep": "15 Mins",
    "cook": "10 Mins",
    "ready in": "35 Mins",
    "servings": "8 servings",
    "ingredients": [
      "2 pounds ground beef",
      "1 egg, beaten",
      "¾ cup dry bread crumbs",
      "3 tablespoons evaporated milk",
      "2 tablespoons Worcestershire sauce",
      "⅛ teaspoon cayenne pepper",
      "2 cloves garlic, minced"
    ],
    "directions": [
      "Preheat grill for high heat.\n",
      "In a large bowl, mix the ground beef, egg, bread crumbs, evaporated milk, Worcestershire sauce, cayenne pepper, and garlic using your hands. Form the mixture into 8 hamburger patties.\n",
      "Lightly oil the grill grate. Grill patties 5 minutes per side, or until well done.\n"
    ],
    "calories": 289,
    "carb": 10,
    "protein": 22,
    "fat": 18
  },
  {
    "url": "https://www.allrecipes.com/recipe/230857/easy-tuna-patties/",
    "name": "Easy Tuna Patties",
    "prep": "15 Mins",
    "cook": "10 Mins",
    "ready in": "25 Mins",
    "servings": "4 servings",
    "ingredients": [
      "2 eggs",
      "2 teaspoons lemon juice",
      "3 tablespoons grated Parmesan cheese",
      "10 tablespoons Italian-seasoned bread crumbs",
      "3 (5 ounce) cans tuna, drained",
      "3 tablespoons diced onion",
      "1 pinch ground black pepper",
      "3 tablespoons vegetable oil"
    ],
    "directions": [
      "Beat eggs and lemon juice in a bowl; stir in Parmesan cheese and bread crumbs to make a paste. Fold in tuna and onion until well-mixed. Season with black pepper. Shape tuna mixture into eight 1-inch-thick patties.\n",
      "Heat vegetable oil in a skillet over medium heat; fry patties until golden brown, about 5 minutes per side.\n"
    ],
    "calories": 325,
    "carb": 14,
    "protein": 32,
    "fat": 16
  },
  {
    "url": "https://www.allrecipes.com/recipe/25490/broccoli-rice-cheese-and-chicken-casserole/",
    "name": "Broccoli, Rice, Cheese, and Chicken Casserole",
    "prep": "15 Mins",
    "cook": "30 Mins",
    "ready in": "45 Mins",
    "servings": "8 servings",
    "ingredients": [
      "2 cups water",
      "2 cups uncooked instant rice",
      "2 (10 ounce) cans chunk chicken, drained",
      "1 (10.75 ounce) can  condensed cream of mushroom soup",
      "1 (10.75 ounce) can  condensed cream of chicken soup",
      "¼ cup butter",
      "1 cup milk",
      "1 (16 ounce) package frozen chopped broccoli",
      "1 small white onion, chopped",
      "1 pound processed cheese food"
    ],
    "directions": [
      "Preheat oven to 350 degrees F (175 degrees C).\n",
      "In a medium saucepan, bring the water to a boil. Mix in the instant rice, cover, and remove from heat. Let stand 5 minutes.\n",
      "In a 9x13 inch baking dish, mix the prepared rice, chicken, cream of mushroom soup, cream of chicken soup, butter, milk, broccoli, onion, and processed cheese.\n",
      "Bake in the preheated oven for 30 to 35 minutes, or until cheese is melted. Stir halfway through cooking to help cheese melt evenly.\n"
    ],
    "calories": 757,
    "carb": 83,
    "protein": 36,
    "fat": 31
  },
  {
    "url": "https://www.allrecipes.com/recipe/222009/3-cheese-enchiladas/",
    "name": "3 Cheese Enchiladas",
    "prep": "40 Mins",
    "cook": "20 Mins",
    "ready in": "60 Mins",
    "servings": "6 servings",
    "ingredients": [
      "1 (8 ounce) package cream cheese, softened",
      "3 cups salsa, divided",
      "4 green onions, chopped, divided",
      "2 ½ cups Cheddar cheese, divided",
      "2 ½ cups shredded Monterey Jack cheese, divided",
      "12 (8 inch) flour tortillas"
    ],
    "directions": [
      "Preheat the oven to 350 degrees F (175 degrees C).\n",
      "Mix cream cheese with 2 cups salsa and 2 chopped green onions in a bowl until thoroughly combined; lightly stir 2 cups shredded Cheddar and 2 cups Monterey Jack cheese into cream cheese mixture. Spoon a scant 1/2 cup of cheese filling in a line down the center of each tortilla and roll tortilla into a log around the filling. Repeat with remaining tortillas and cheese filling. Place rolled tortillas into a 9x13-inch baking dish.\n",
      "Spread top of enchiladas with remaining 1 cup salsa. Lightly mix remaining 1/2 cup Cheddar cheese and 1/2 cup Monterey Jack cheese in a bowl and spread over the salsa. Sprinkle with remaining green onions. Cover dish with aluminum foil.\n",
      "Bake in preheated oven until cheese is melted and bubbly, about 20 minutes.\n"
    ],
    "calories": 853,
    "carb": 66,
    "protein": 37,
    "fat": 51
  },
  {
    "url": "https://www.allrecipes.com/recipe/268249/italian-baked-meatballs/",
    "name": "Italian Baked Meatballs",
    "prep": "20 Mins",
    "cook": "30 Mins",
    "ready in": "50 Mins",
    "servings": "30 1-ounce meatballs",
    "ingredients": [
      "1 cup Italian-seasoned bread crumbs",
      "¼ cup grated Romano cheese",
      "2 tablespoons chopped fresh parsley",
      "½ teaspoon salt",
      "½ teaspoon ground black pepper",
      "½ teaspoon garlic powder",
      "½ teaspoon onion powder",
      "½ cup water",
      "2 eggs",
      "1 ½ pounds ground beef"
    ],
    "directions": [
      "Preheat the oven to 350 degrees F (175 degrees C).\n",
      "Mix bread crumbs, Romano cheese, parsley, salt, pepper, garlic powder, and onion powder together. Combine with water and eggs. Add ground beef and mix well. Roll mixture into balls and place on a nonstick baking sheet.\n",
      "Bake in the preheated oven until browned, about 30 minutes.\n"
    ],
    "calories": 343,
    "carb": 15,
    "protein": 25,
    "fat": 21
  },
  {
    "url": "https://www.allrecipes.com/recipe/240208/simple-baked-chicken-breasts/",
    "name": "Simple Baked Chicken Breasts",
    "prep": "15 Mins",
    "cook": "25 Mins",
    "ready in": "40 Mins",
    "servings": "4 servings",
    "ingredients": [
      "4 skinless, boneless chicken breast halves",
      "2 tablespoons olive oil",
      "1 tablespoon coarse sea salt",
      "1 pinch Creole seasoning (such as Tony Chachere's®), or to taste",
      "1 tablespoon water, or as needed"
    ],
    "directions": [
      "Preheat convection oven to 400 degrees F (200 degrees C).\n",
      "Rub chicken breasts with olive oil and sprinkle both sides with salt and Creole seasoning. Place chicken in a broiler pan.\n",
      "Bake in the preheated oven for 10 minutes. Flip chicken and cook until no longer pink in the center and the juices run clear, about 15 minutes more. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).\n",
      "Remove chicken from pan. Pour water into the pan, while scraping the browned bits of food off of the bottom of the pan with a wooden spoon. Add more water if needed to dislodge the browned bits; serve alongside chicken.\n"
    ],
    "calories": 191,
    "carb": 1,
    "protein": 25,
    "fat": 10
  },
  {
    "url": "https://www.allrecipes.com/recipe/229960/shrimp-scampi-with-pasta/",
    "name": "Shrimp Scampi with Pasta",
    "prep": "20 Mins",
    "cook": "20 Mins",
    "ready in": "40 Mins",
    "servings": "6 servings",
    "ingredients": [
      "1 (16 ounce) package linguine pasta",
      "2 tablespoons butter",
      "2 tablespoons extra-virgin olive oil",
      "2 shallots, finely diced",
      "2 cloves garlic, minced",
      "1 pinch red pepper flakes",
      "1 pound shrimp, peeled and deveined",
      "1 pinch kosher salt and freshly ground pepper",
      "½ cup dry white wine",
      "1 lemon, juiced",
      "2 tablespoons butter",
      "2 tablespoons extra-virgin olive oil",
      "¼ cup finely chopped fresh parsley leaves",
      "1 teaspoon extra-virgin olive oil, or to taste"
    ],
    "directions": [
      "Bring a large pot of salted water to a boil; cook linguine in boiling water until nearly tender, 6 to 8 minutes. Drain.\n",
      "Melt 2 tablespoons butter with 2 tablespoons olive oil in a large skillet over medium heat. Cook and stir shallots, garlic, and red pepper flakes in the hot butter and oil until shallots are translucent, 3 to 4 minutes. Season shrimp with kosher salt and black pepper; add to the skillet and cook until pink, stirring occasionally, 2 to 3 minutes. Remove shrimp from skillet and keep warm.\n",
      "Pour white wine and lemon juice into skillet and bring to a boil while scraping the browned bits of food off of the bottom of the skillet with a wooden spoon. Melt 2 tablespoons butter in skillet, stir 2 tablespoons olive oil into butter mixture, and bring to a simmer. Toss linguine, shrimp, and parsley in the butter mixture until coated; season with salt and black pepper. Drizzle with 1 teaspoon olive oil to serve.\n"
    ],
    "calories": 512,
    "carb": 58,
    "protein": 22,
    "fat": 20
  },
  {
    "url": "https://www.allrecipes.com/recipe/8495/chicken-cordon-bleu-i/",
    "name": "Chicken Cordon Bleu I",
    "prep": "10 Mins",
    "cook": "35 Mins",
    "ready in": "45 Mins",
    "servings": "4 servings",
    "ingredients": [
      "4 skinless, boneless chicken breast halves",
      "¼ teaspoon salt",
      "⅛ teaspoon ground black pepper",
      "6 slices Swiss cheese",
      "4 slices cooked ham",
      "½ cup seasoned bread crumbs"
    ],
    "directions": [
      "Preheat oven to 350 degrees F (175 degrees C).  Coat a 7x11 inch baking dish with nonstick cooking spray.\n",
      "Pound chicken breasts to 1/4 inch thickness.\n",
      "Sprinkle each piece of chicken on both sides with salt and pepper.  Place 1 cheese slice and 1 ham slice on top of each breast. Roll up each breast, and secure with a toothpick.  Place in baking dish, and sprinkle chicken evenly with bread crumbs.\n",
      "Bake for 30 to 35 minutes, or until chicken is no longer pink. Remove from oven, and place 1/2 cheese slice on top of each breast.  Return to oven for 3 to 5 minutes, or until cheese has melted. Remove toothpicks, and serve immediately.\n"
    ],
    "calories": 419,
    "carb": 13,
    "protein": 47,
    "fat": 20
  },
  {
    "url": "https://www.allrecipes.com/recipe/273852/easy-baked-chicken-tenders/",
    "name": "Easy Baked Chicken Tenders",
    "prep": "n/a",
    "cook": "n/a",
    "ready in": "n/a",
    "servings": "4 servings",
    "ingredients": [
      "vegetable cooking spray (such as I Can't Believe It's Not Butter!®)",
      "1 egg, beaten",
      "1 ¼ cups panko bread crumbs",
      "2 teaspoons garlic powder",
      "1 teaspoon onion powder",
      "1 teaspoon paprika",
      "1 teaspoon kosher salt",
      "1 teaspoon ground black pepper",
      "4 skinless, boneless chicken tenders, cut into 1/2-inch strips lengthwise"
    ],
    "directions": [
      "Preheat the oven to 450 degrees F (230 degrees C). Line a baking sheet with aluminum foil and spray with cooking spray.\n",
      "Place egg in a shallow dish. Place bread crumbs, garlic powder, onion powder, paprika, salt, and pepper into a large zip-top freezer bag and mix well. Dip 2 chicken strips into egg and then place into bread crumb mixture and shake to coat. Place coated chicken pieces onto the prepared baking sheet. Repeat with remaining chicken.\n",
      "Spray each chicken tender with cooking spray 2 times.\n",
      "Bake tenders in the preheated oven for 7 minutes; flip, continue to bake on opposite side until no longer pink in the centers, about 7 minutes more. Remove from the oven.\n",
      "Set an oven rack about 6 inches from the heat source and preheat the oven's broiler.\n",
      "Broil tenders in the preheated oven for extra crunch, about 2 minutes more.\n"
    ],
    "calories": 172,
    "carb": 26,
    "protein": 17,
    "fat": 4
  },
  {
    "url": "https://www.allrecipes.com/recipe/16311/simple-beef-stroganoff/",
    "name": "Simple Beef Stroganoff",
    "prep": "20 Mins",
    "cook": "10 Mins",
    "ready in": "30 Mins",
    "servings": "4 servings",
    "ingredients": [
      "1 (8 ounce) package egg noodles",
      "1 pound ground beef",
      "1 (10.75 ounce) can  fat free condensed cream of mushroom soup",
      "1 tablespoon garlic powder",
      "½ cup sour cream",
      "salt and pepper to taste"
    ],
    "directions": [
      "Prepare the egg noodles according to package directions and set aside.\n",
      "In a separate large skillet over medium heat, saute the ground beef over medium heat for 5 to 10 minutes, or until browned. Drain the fat and add the soup and garlic powder. Simmer for 10 minutes, stirring occasionally.\n",
      "Remove from heat and combine the meat mixture with the egg noodles. Add the sour cream, stirring well, and season with salt and pepper to taste.\n"
    ],
    "calories": 679,
    "carb": 49,
    "protein": 29,
    "fat": 41
  },
  {
    "url": "https://www.allrecipes.com/recipe/239042/roasted-cauliflower-steaks/",
    "name": "Roasted Cauliflower Steaks",
    "prep": "10 Mins",
    "cook": "30 Mins",
    "ready in": "40 Mins",
    "servings": "4 servings",
    "ingredients": [
      "1 large head cauliflower, sliced lengthwise through the core into 4 'steaks'",
      "¼ cup olive oil",
      "1 tablespoon fresh lemon juice",
      "2 cloves garlic, minced",
      "1 pinch red pepper flakes, or to taste",
      "salt and ground black pepper to taste"
    ],
    "directions": [
      "Preheat oven to 400 degrees F (200 degrees C). Line a baking sheet with parchment paper.\n",
      "Place cauliflower steaks on the prepared baking sheet.\n",
      "Whisk olive oil, lemon juice, garlic, red pepper flakes, salt, and black pepper together in a bowl. Brush 1/2 of the olive oil mixture over the tops of the cauliflower steaks.\n",
      "Roast cauliflower steaks in the preheated oven for 15 minutes. Gently turn over each steak and brush with remaining olive oil mixture. Continue roasting until tender and golden, 15 to 20 minutes more.\n"
    ],
    "calories": 176,
    "carb": 13,
    "protein": 5,
    "fat": 14
  },
  {
    "url": "https://www.allrecipes.com/recipe/235153/easy-baked-chicken-thighs/",
    "name": "Easy Baked Chicken Thighs",
    "prep": "5 Mins",
    "cook": "30 Mins",
    "ready in": "35 Mins",
    "servings": "4 servings",
    "ingredients": [
      "4 chicken thighs",
      "4 teaspoons garlic powder",
      "4 teaspoons onion flakes"
    ],
    "directions": [
      "Preheat oven to 375 degrees F (190 degrees C).\n",
      "Place thighs in a baking dish. Season chicken thighs on all sides with garlic powder and onion flakes.\n",
      "Bake chicken in the preheated oven until no longer pink at the bone and the juices run clear, about 30 minutes. An instant-read thermometer inserted into the thickest part of the thigh, near the bone should read 165 degrees F (74 degrees C).\n"
    ],
    "calories": 162,
    "carb": 3,
    "protein": 20,
    "fat": 8
  },
  {
    "url": "https://www.allrecipes.com/recipe/20680/easy-mexican-casserole/",
    "name": "Easy Mexican Casserole",
    "prep": "20 Mins",
    "cook": "30 Mins",
    "ready in": "50 Mins",
    "servings": "6 servings",
    "ingredients": [
      "1 pound lean ground beef",
      "2 cups salsa",
      "1 (16 ounce) can chili beans, drained",
      "3 cups tortilla chips, crushed",
      "2 cups sour cream",
      "1 (2 ounce) can sliced black olives, drained",
      "½ cup chopped green onion",
      "½ cup chopped fresh tomato",
      "2 cups shredded Cheddar cheese"
    ],
    "directions": [
      "Preheat oven to 350 degrees F (175 degrees C).\n",
      "In a large skillet over medium-high heat, cook ground beef until no longer pink. Stir in salsa, reduce heat, and simmer 20 minutes, or until liquid is absorbed. Stir in beans, and heat through.\n",
      "Spray a 9x13 baking dish with cooking spray. Spread crushed tortilla chips in dish, and then spoon beef mixture over chips. Spread sour cream over beef, and sprinkle olives, green onion, and tomato over the sour cream. Top with Cheddar cheese.\n",
      "Bake in preheated oven for 30 minutes, or until hot and bubbly.\n"
    ],
    "calories": 632,
    "carb": 33,
    "protein": 32,
    "fat": 44
  },
  {
    "url": "https://www.allrecipes.com/recipe/275548/air-fryer-meatballs/",
    "name": "Air Fryer Meatballs",
    "prep": "10 Mins",
    "cook": "20 Mins",
    "ready in": "35 Mins",
    "servings": "16 meatballs",
    "ingredients": [
      "16 ounces lean ground beef",
      "4 ounces ground pork",
      "1 teaspoon Italian seasoning",
      "½ teaspoon salt",
      "2 cloves garlic, minced",
      "1 egg",
      "½ cup grated Parmesan cheese",
      "⅓ cup Italian seasoned bread crumbs"
    ],
    "directions": [
      "Preheat the air fryer to 350 degrees F (175 degrees C).\n",
      "Combine beef, pork, Italian seasoning, salt, garlic, egg, Parmesan cheese, and bread crumbs in a large bowl. Mix well until evenly combined. Form into 16 equally-sized meatballs using an ice cream scoop and place on a baking sheet.\n",
      "Place 1/2 of the meatballs in the basket of the air fryer and cook 8 minutes. Shake the basket and cook 2 minutes more. Transfer to a serving plate and let rest for 5 minutes. Repeat with remaining meatballs.\n"
    ],
    "calories": 96,
    "carb": 2,
    "protein": 8,
    "fat": 7
  },
  {
    "url": "https://www.allrecipes.com/recipe/222202/grilled-cod/",
    "name": "Grilled Cod",
    "prep": "10 Mins",
    "cook": "10 Mins",
    "ready in": "35 Mins",
    "servings": "4 servings",
    "ingredients": [
      "2 (8 ounce) fillets cod, cut in half",
      "1 tablespoon Cajun seasoning",
      "½ teaspoon lemon pepper",
      "¼ teaspoon salt",
      "¼ teaspoon ground black pepper",
      "2 tablespoons butter",
      "1 lemon, juiced",
      "2 tablespoons chopped green onion (white part only)"
    ],
    "directions": [
      "Stack about 15 charcoal briquettes into a grill in a pyramid shape. If desired, drizzle coals lightly with lighter fluid and allow to soak for 1 minute before lighting coals with a match. Allow fire to spread to all coals, about 10 minutes, before spreading briquettes out into the grill; let coals burn until a thin layer of white ash covers the coals. Lightly oil the grates.\n",
      "Season both sides of cod with Cajun seasoning, lemon pepper, salt, and black pepper. Set fish aside on a plate. Heat butter in a small saucepan over medium heat, stir in lemon juice and green onion, and cook until onion is softened, about 3 minutes.\n",
      "Place cod onto oiled grates and grill until fish is browned and flakes easily, about 3 minutes per side; baste with butter mixture frequently while grilling. Allow cod to rest off the heat for about 5 minutes before serving.\n"
    ],
    "calories": 152,
    "carb": 3,
    "protein": 21,
    "fat": 7
  },
  {
    "url": "https://www.allrecipes.com/recipe/20225/creamed-chipped-beef-on-toast/",
    "name": "Creamed Chipped Beef On Toast",
    "prep": "10 Mins",
    "cook": "10 Mins",
    "ready in": "20 Mins",
    "servings": "4 servings",
    "ingredients": [
      "2 tablespoons butter",
      "2 tablespoons all-purpose flour",
      "1 ½ cups warm milk",
      "1 (8 ounce) jar dried beef",
      "1 pinch cayenne pepper"
    ],
    "directions": [
      "In a medium saucepan over low heat, melt butter.  Whisk in flour all at once to form a roux.  Whisk in milk, a little at a time, increase heat to medium-high, and cook, stirring, until thickened.  Bring to a boil, stir in beef and cayenne, heat through and serve over toast.\n"
    ],
    "calories": 197,
    "carb": 9,
    "protein": 21,
    "fat": 9
  },
  {
    "url": "https://www.allrecipes.com/recipe/22448/easy-fried-eggplant/",
    "name": "Easy Fried Eggplant",
    "prep": "20 Mins",
    "cook": "15 Mins",
    "ready in": "35 Mins",
    "servings": "4 servings",
    "ingredients": [
      "2 tablespoons canola oil",
      "1 large eggplant, peeled and sliced",
      "3 eggs, beaten",
      "2 cups dry bread crumbs"
    ],
    "directions": [
      "Heat oil in a large skillet over medium-high heat.  Dip eggplant slices in egg, then in crumbs, and place in hot oil.  Fry 2 to 3 minutes on each side, or until golden brown.  Drain on paper towels.\n"
    ],
    "calories": 358,
    "carb": 46,
    "protein": 13,
    "fat": 14
  },
  {
    "url": "https://www.allrecipes.com/recipe/25473/the-perfect-basic-burger/",
    "name": "The Perfect Basic Burger",
    "prep": "15 Mins",
    "cook": "16 Mins",
    "ready in": "35 Mins",
    "servings": "4 hamburger patties",
    "ingredients": [
      "1 egg",
      "½ teaspoon salt",
      "½ teaspoon ground black pepper",
      "1 pound ground beef",
      "½ cup fine dry bread crumbs"
    ],
    "directions": [
      "Preheat an outdoor grill for high heat and lightly oil grate.\n",
      "In a medium bowl, whisk together egg, salt and pepper. Place ground beef and bread crumbs into the mixture. With hands or a fork, mix until well blended. Form into 4 patties approximately 3/4 inch thick.\n",
      "Place patties on the prepared grill. Cover and cook 6 to 8 minutes per side, or to desired doneness.\n"
    ],
    "calories": 318,
    "carb": 10,
    "protein": 28,
    "fat": 18
  },
  {
    "url": "https://www.allrecipes.com/recipe/272858/air-fryer-chicken-thighs/",
    "name": "Air Fryer Chicken Thighs",
    "prep": "10 Mins",
    "cook": "20 Mins",
    "ready in": "30 Mins",
    "servings": "4 servings",
    "ingredients": [
      "4 skin-on, boneless chicken thighs",
      "2 teaspoons extra-virgin olive oil",
      "1 teaspoon smoked paprika",
      "¾ teaspoon garlic powder",
      "½ teaspoon salt",
      "½ teaspoon ground black pepper"
    ],
    "directions": [
      "Preheat an air fryer to 400 degrees F (200 degrees C).\n",
      "Pat chicken thighs dry with a paper towel and brush the skin-side of each piece with olive oil. Place chicken thighs, skin-side down, in a single layer on a plate.\n",
      "Combine smoked paprika, garlic powder, salt, and pepper in a bowl and sprinkle half the seasoning mixture evenly over the 4 chicken thighs. Turn thighs over and evenly sprinkle remaining seasoning mixture on top. Place chicken thighs in the air fryer basket in a single layer, skin-side up.\n",
      "Fry in the preheated air fryer until chicken is brown and juices run clear, about 18 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).\n"
    ],
    "calories": 214,
    "carb": 1,
    "protein": 20,
    "fat": 15
  },
  {
    "url": "https://www.allrecipes.com/recipe/22538/baked-salmon-fillets-dijon/",
    "name": "Baked Salmon Fillets Dijon",
    "prep": "10 Mins",
    "cook": "15 Mins",
    "ready in": "25 Mins",
    "servings": "4 servings",
    "ingredients": [
      "4 (4 ounce) fillets salmon",
      "3 tablespoons prepared Dijon-style mustard",
      "salt and pepper to taste",
      "¼ cup Italian-style dry bread crumbs",
      "¼ cup butter, melted"
    ],
    "directions": [
      "Preheat oven to 400 degrees F (200 degrees C). Line a shallow baking pan with aluminum foil.\n",
      "Place salmon skin-side down on foil. Spread a thin layer of mustard on the top of each fillet, and season with salt and pepper. Top with bread crumbs, then drizzle with melted butter.\n",
      "Bake in a preheated oven for 15 minutes, or until salmon flakes easily with a fork.\n"
    ],
    "calories": 331,
    "carb": 8,
    "protein": 25,
    "fat": 22
  },
  {
    "url": "https://www.allrecipes.com/recipe/260625/crumbed-chicken-tenderloins-air-fried/",
    "name": "Crumbed Chicken Tenderloins (Air Fried)",
    "prep": "15 Mins",
    "cook": "12 Mins",
    "ready in": "27 Mins",
    "servings": "8 tenderloins",
    "ingredients": [
      "1 egg",
      "½ cup dry bread crumbs",
      "2 tablespoons vegetable oil",
      "8 chicken tenderloins"
    ],
    "directions": [
      "Preheat an air fryer to 350 degrees F (175 degrees C).\n",
      "Whisk egg in a small bowl.\n",
      "Mix bread crumbs and oil together in a second bowl until mixture becomes loose and crumbly.\n",
      "Dip each chicken tenderloin into the bowl of egg; shake off any residual egg. Dip chicken into the crumb mixture, making sure it is evenly and fully covered. Lay chicken tenderloins into the basket of the air fryer. Cook until no longer pink in the center, about 12 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).\n"
    ],
    "calories": 253,
    "carb": 10,
    "protein": 27,
    "fat": 12
  },
  {
    "url": "https://www.allrecipes.com/recipe/232906/simple-broiled-haddock/",
    "name": "Simple Broiled Haddock",
    "prep": "10 Mins",
    "cook": "10 Mins",
    "ready in": "20 Mins",
    "servings": "4 servings",
    "ingredients": [
      "cooking spray",
      "2 pounds haddock fillets",
      "½ teaspoon onion powder",
      "½ teaspoon paprika",
      "½ teaspoon garlic powder",
      "½ teaspoon ground black pepper",
      "½ teaspoon salt",
      "¼ teaspoon cayenne pepper",
      "1 tablespoon butter, cut in small pieces",
      "1 lemon, cut into wedges"
    ],
    "directions": [
      "Set oven rack about 6 inches from the heat source and preheat the oven's broiler. Line a baking sheet with aluminum foil and spray with cooking spray.\n",
      "Arrange haddock fillets on the prepared baking sheet. Mix onion powder, paprika, garlic powder, salt, black pepper, and cayenne pepper in a small bowl; sprinkle seasoning over haddock. Dot haddock with pieces of butter.\n",
      "Broil in the preheated oven until fish is easily flaked with a fork, 6 to 8 minutes. Serve with lemon wedges.\n"
    ],
    "calories": 229,
    "carb": 1,
    "protein": 44,
    "fat": 5
  },
  {
    "url": "https://www.allrecipes.com/recipe/235432/creamy-herbed-pork-chops/",
    "name": "Creamy Herbed Pork Chops",
    "prep": "10 Mins",
    "cook": "25 Mins",
    "ready in": "35 Mins",
    "servings": "4 servings",
    "ingredients": [
      "4 thick-cut pork chops",
      "1 teaspoon Montreal steak seasoning, or to taste",
      "½ cup butter, divided",
      "2 ½ tablespoons all-purpose flour, or as needed",
      "1 tablespoon dried basil",
      "1 teaspoon instant beef bouillon granules",
      "1 teaspoon freshly ground black pepper",
      "2 cups milk"
    ],
    "directions": [
      "Season pork chops on all sides with Montreal steak seasoning.\n",
      "Melt 2 tablespoons butter in a large skillet over medium heat. Cook chops in melted butter until browned and slightly pink in the center, about 7 to 10 minutes per side. An instant-read thermometer inserted into the center should read at least 145 degrees F (63 degrees C). Add remaining butter to the pan as needed so that about 3 tablespoons pan drippings remain in the pan when the chops are finished cooking. Transfer pork chops to a plate and return skillet to medium-high heat.\n",
      "Mix flour, basil, and beef bouillon together in a bowl. Stir black pepper into skillet with the pan drippings and cook for 1 minute. Add flour mixture and cook, stirring constantly, until browned, about 2 minutes. Pour milk into flour mixture; cook and stir constantly until mixture is thick and bubbly, 4 to 6 minutes. Pour sauce over pork chops and serve.\n"
    ],
    "calories": 601,
    "carb": 11,
    "protein": 41,
    "fat": 44
  },
  {
    "url": "https://www.allrecipes.com/recipe/76659/heavenly-halibut/",
    "name": "Heavenly Halibut",
    "prep": "15 Mins",
    "cook": "10 Mins",
    "ready in": "25 Mins",
    "servings": "8 servings",
    "ingredients": [
      "½ cup grated Parmesan cheese",
      "¼ cup butter, softened",
      "3 tablespoons mayonnaise",
      "2 tablespoons lemon juice",
      "3 tablespoons chopped green onions",
      "¼ teaspoon salt",
      "1 dash hot pepper sauce",
      "2 pounds skinless halibut fillets"
    ],
    "directions": [
      "Preheat the oven broiler. Grease a baking dish.\n",
      "In a bowl, mix the Parmesan cheese, butter, mayonnaise, lemon juice, green onions, salt, and hot pepper sauce.\n",
      "Arrange the halibut fillets in the prepared baking dish.\n",
      "Broil halibut fillets 8 minutes in the prepared oven, or until easily flaked with a fork. Spread with the Parmesan cheese mixture, and continue broiling 2 minutes, or until topping is bubbly and lightly browned.\n"
    ],
    "calories": 236,
    "carb": 1,
    "protein": 26,
    "fat": 14
  },
  {
    "url": "https://www.allrecipes.com/recipe/21306/fish-in-foil/",
    "name": "Fish in Foil",
    "prep": "10 Mins",
    "cook": "20 Mins",
    "ready in": "30 Mins",
    "servings": "2 servings",
    "ingredients": [
      "2 rainbow trout fillets",
      "1 tablespoon olive oil",
      "2 teaspoons garlic salt",
      "1 teaspoon ground black pepper",
      "1 fresh jalapeno pepper, sliced",
      "1 lemon, sliced"
    ],
    "directions": [
      "Preheat oven to 400 degrees F (200 degrees C). Rinse fish, and pat dry.\n",
      "Rub fillets with olive oil, and season with garlic salt and black pepper. Place each fillet on a large sheet of aluminum foil.  Top with jalapeno slices, and squeeze the juice from the ends of the lemons over the fish. Arrange lemon slices on top of fillets. Carefully seal all edges of the foil to form enclosed packets. Place packets on baking sheet.\n",
      "Bake in preheated oven for 15 to 20 minutes, depending on the size of fish. Fish is done when it flakes easily with a fork.\n"
    ],
    "calories": 214,
    "carb": 8,
    "protein": 25,
    "fat": 11
  },
  {
    "url": "https://www.allrecipes.com/recipe/258013/easy-tortilla-pizza/",
    "name": "Easy Tortilla Pizza",
    "prep": "15 Mins",
    "cook": "8 Mins",
    "ready in": "23 Mins",
    "servings": "1 pizza",
    "ingredients": [
      "1 (8 inch) soft flour tortilla",
      "1 teaspoon olive oil",
      "1 pinch garlic powder",
      "salt and ground black pepper to taste",
      "3 tablespoons tomato sauce",
      "1 cooked chicken breast, sliced",
      "½ green bell pepper, chopped",
      "2 green onions, finely chopped",
      "⅓ cup shredded mozzarella cheese",
      "1 pinch dried oregano"
    ],
    "directions": [
      "Preheat oven to 400 degrees F (200 degrees C).\n",
      "Place tortilla on a baking sheet. Brush with olive oil; sprinkle garlic powder, salt, and pepper on top.\n",
      "Bake in the preheated oven until golden, 3 to 5 minutes. Remove tortilla from the oven and spread tomato sauce on top. Arrange chicken breast, green bell pepper, and green onions over tomato sauce; cover with mozzarella cheese.\n",
      "Bake in the preheated oven until cheese is melted, about 5 minutes. Sprinkle oregano over cheese. Slice pizza into wedges using a pizza cutter.\n"
    ],
    "calories": 834,
    "carb": 38,
    "protein": 72,
    "fat": 44
  },
  {
    "url": "https://www.allrecipes.com/recipe/244458/buttered-noodles/",
    "name": "Buttered Noodles",
    "prep": "5 Mins",
    "cook": "10 Mins",
    "ready in": "15 Mins",
    "servings": "8 servings",
    "ingredients": [
      "1 (16 ounce) package fettuccine noodles",
      "6 tablespoons butter",
      "⅓ cup grated Parmesan cheese",
      "salt and ground black pepper to taste"
    ],
    "directions": [
      "Fill a large pot with lightly salted water and bring to a rolling boil. Stir in fettuccine, bring back to a boil, and cook pasta over medium heat until tender yet firm to the bite, 8 to 10 minutes. Drain and return pasta to pot.\n",
      "Mix butter, Parmesan cheese, salt, and pepper into pasta until evenly combined.\n"
    ],
    "calories": 295,
    "carb": 42,
    "protein": 9,
    "fat": 11
  },
  {
    "url": "https://www.allrecipes.com/recipe/76808/italian-sausage-peppers-and-onions/",
    "name": "Italian Sausage, Peppers, and Onions",
    "prep": "15 Mins",
    "cook": "25 Mins",
    "ready in": "40 Mins",
    "servings": "6 servings",
    "ingredients": [
      "6 (4 ounce) links sweet Italian sausage",
      "2 tablespoons butter",
      "1 yellow onion, sliced",
      "½ red onion, sliced",
      "4 cloves garlic, minced",
      "1 large red bell pepper, sliced",
      "1 green bell pepper, sliced",
      "1 teaspoon dried basil",
      "1 teaspoon dried oregano",
      "¼ cup white wine"
    ],
    "directions": [
      "Place the sausage in a large skillet over medium heat, and brown on all sides. Remove from skillet, and slice.\n",
      "Melt butter in the skillet. Stir in the yellow onion, red onion, and garlic, and cook 2 to 3 minutes. Mix in red bell pepper and green bell pepper. Season with basil, and oregano. Stir in white wine. Continue to cook and stir until peppers and onions are tender.\n",
      "Return sausage slices to skillet with the vegetables. Reduce heat to low, cover, and simmer 15 minutes, or until sausage is heated through.\n"
    ],
    "calories": 462,
    "carb": 7,
    "protein": 18,
    "fat": 40
  },
  {
    "url": "https://www.allrecipes.com/recipe/285028/salmon-meuniere/",
    "name": "Salmon Meuniere",
    "prep": "10 Mins",
    "cook": "10 Mins",
    "ready in": "20 Mins",
    "servings": "4 servings",
    "ingredients": [
      "4 (4 ounce) center-cut salmon fillets, with skin",
      "salt and ground black pepper to taste",
      "¼ cup all-purpose flour",
      "1 tablespoon butter",
      "1 tablespoon olive oil",
      "3 tablespoons butter",
      "2 tablespoons lemon juice",
      "1 teaspoon lemon zest",
      "1 tablespoon minced fresh parsley"
    ],
    "directions": [
      "Preheat the oven to 200 degrees F (95 degrees C).\n",
      "Season salmon with salt and pepper. Place flour in a small dish and lightly dredge the salmon pieces, shaking off any excess.\n",
      "Heat butter and oil in a skillet over medium-high heat. Place salmon, flesh-side down, into the pan and brown for 3 minutes. Gently flip pieces over and cook an additional 3 minutes. Remove salmon to a plate and keep warm in the oven. Wipe out the skillet with a paper towel.\n",
      "Return the skillet to medium-high heat. Melt butter for sauce, then whisk in lemon juice and lemon zest. Cook and stir until warmed and slightly reduced, 1 to 2 minutes. Remove from heat and stir in parsley. Drizzle sauce over salmon and serve.\n"
    ],
    "calories": 345,
    "carb": 7,
    "protein": 21,
    "fat": 26
  },
  {
    "url": "https://www.allrecipes.com/recipe/8849/baked-chicken-nuggets/",
    "name": "Baked Chicken Nuggets",
    "prep": "20 Mins",
    "cook": "20 Mins",
    "ready in": "40 Mins",
    "servings": "30 nuggets",
    "ingredients": [
      "3 skinless, boneless chicken breasts",
      "1 cup Italian seasoned bread crumbs",
      "½ cup grated Parmesan cheese",
      "1 teaspoon salt",
      "1 teaspoon dried thyme",
      "1 tablespoon dried basil",
      "½ cup butter, melted"
    ],
    "directions": [
      "Preheat oven to 400 degrees F (200 degrees C).\n",
      "Cut chicken breasts into 1 1/2-inch sized pieces. In a medium bowl, mix together the bread crumbs, cheese, salt, thyme and basil. Mix well. Put melted butter in a bowl or dish for dipping.\n",
      "Dip chicken pieces into the melted butter first, then coat with the breadcrumb mixture. Place the well-coated chicken pieces on a lightly greased cookie sheet in a single layer, and bake in the preheated oven for 20 minutes.\n"
    ],
    "calories": 309,
    "carb": 15,
    "protein": 20,
    "fat": 20
  },
  {
    "url": "https://www.allrecipes.com/recipe/235997/unstuffed-cabbage-roll/",
    "name": "Unstuffed Cabbage Roll",
    "prep": "20 Mins",
    "cook": "35 Mins",
    "ready in": "55 Mins",
    "servings": "6 servings",
    "ingredients": [
      "2 pounds ground beef",
      "1 large onion, chopped",
      "1 small head cabbage, chopped",
      "2 (14.5 ounce) cans diced tomatoes",
      "1 (8 ounce) can tomato sauce",
      "½ cup water",
      "2 cloves garlic, minced",
      "2 teaspoons salt",
      "1 teaspoon ground black pepper"
    ],
    "directions": [
      "Heat a Dutch oven or large skillet over medium-high heat. Cook and stir beef and onion in the hot Dutch oven until browned and crumbly, 5 to 7 minutes; drain and discard grease. Add cabbage, tomatoes, tomato sauce, water, garlic, salt, and pepper and bring to a boil. Cover Dutch oven, reduce heat, and simmer until cabbage is tender, about 30 minutes.\n"
    ],
    "calories": 399,
    "carb": 17,
    "protein": 29,
    "fat": 24
  },
  {
    "url": "https://www.allrecipes.com/recipe/82347/best-ever-crab-cakes/",
    "name": "Best Ever Crab Cakes",
    "prep": "15 Mins",
    "cook": "12 Mins",
    "ready in": "27 Mins",
    "servings": "4 patties",
    "ingredients": [
      "1 egg",
      "3 tablespoons mayonnaise",
      "4 teaspoons lemon juice",
      "⅛ teaspoon red pepper flakes",
      "1 teaspoon dried tarragon",
      "1 tablespoon minced green onions",
      "8 ounces crabmeat",
      "½ cup crushed buttery round crackers",
      "1 tablespoon butter"
    ],
    "directions": [
      "In a medium bowl, whisk together egg, mayonnaise, lemon juice, red pepper flakes, tarragon, and scallions. Gently stir in crabmeat, being careful not to break up meat. Gradually mix in cracker crumbs, adding until desired consistency is achieved.\n",
      "Heat butter in a skillet over medium heat. Form crab mixture into 4 patties. Place patties in skillet, and cook until golden brown, about 5 to 6 minutes on each side.\n"
    ],
    "calories": 217,
    "carb": 6,
    "protein": 14,
    "fat": 16
  },
  {
    "url": "https://www.allrecipes.com/recipe/240993/lemon-garlic-chicken/",
    "name": "Lemon Garlic Chicken",
    "prep": "10 Mins",
    "cook": "15 Mins",
    "ready in": "25 Mins",
    "servings": "3 servings",
    "ingredients": [
      "2 tablespoons butter",
      "3 skinless, boneless chicken breast halves",
      "1 ½ teaspoons salt",
      "1 ½ teaspoons ground black pepper",
      "2 tablespoons garlic powder",
      "1 lemon, juiced"
    ],
    "directions": [
      "Melt butter in a skillet over medium-high heat.\n",
      "Season chicken with salt and pepper; place in the melted butter. Cook chicken, flipping frequently, until browned, about 5 minutes. Sprinkle 1 tablespoon garlic powder over chicken; flip and sprinkle 1 tablespoon garlic powder on second side. Cook each side for 2 minutes.\n",
      "Pour lemon juice over each side of chicken and cook until no longer pink in the center, 5 to 10 minutes more. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).\n"
    ],
    "calories": 215,
    "carb": 5,
    "protein": 25,
    "fat": 11
  },
  {
    "url": "https://www.allrecipes.com/recipe/17846/incredibly-easy-chicken-and-noodles/",
    "name": "Incredibly Easy Chicken and Noodles",
    "prep": "10 Mins",
    "cook": "30 Mins",
    "ready in": "40 Mins",
    "servings": "6 servings",
    "ingredients": [
      "1 (26 ounce) can condensed cream of chicken soup",
      "1 (10.75 ounce) can  condensed cream of mushroom soup",
      "3 (14.5 ounce) cans chicken broth",
      "2 cups diced, cooked chicken breast meat",
      "2 teaspoons onion powder",
      "1 teaspoon seasoning salt",
      "½ teaspoon garlic powder",
      "2 (9 ounce) packages frozen egg noodles"
    ],
    "directions": [
      "In a large pot, mix the cream of chicken soup, cream of mushroom soup, chicken broth, and chicken meat. Season with onion powder, seasoning salt, and garlic powder. Bring to a boil, and stir in the noodles. Reduce heat to low, and simmer for 20 to 30 minutes.\n"
    ],
    "calories": 504,
    "carb": 55,
    "protein": 28,
    "fat": 20
  },
  {
    "url": "https://www.allrecipes.com/recipe/219164/the-best-parmesan-chicken-bake/",
    "name": "The Best Parmesan Chicken Bake",
    "prep": "15 Mins",
    "cook": "35 Mins",
    "ready in": "50 Mins",
    "servings": "6 servings",
    "ingredients": [
      "2 tablespoons olive oil",
      "2 cloves garlic, crushed and finely chopped",
      "¼ teaspoon crushed red pepper flakes, or to taste",
      "6 skinless, boneless chicken breast halves",
      "2 cups prepared marinara sauce",
      "¼ cup chopped fresh basil",
      "1 (8 ounce) package shredded mozzarella cheese, divided",
      "½ cup grated Parmesan cheese, divided",
      "1 (5 ounce) package garlic croutons"
    ],
    "directions": [
      "Preheat oven to 350 degrees F (175 degrees C).\n",
      "Coat the bottom of a 9x13 inch casserole dish with olive oil, and sprinkle with garlic and hot red pepper flakes.\n",
      "Arrange the chicken breasts in bottom of the dish, and pour marinara sauce over chicken. Sprinkle basil over marinara sauce, and top with half the mozzarella cheese, followed by half the Parmesan cheese. Sprinkle on the croutons, then top with the remaining mozzarella cheese and remaining Parmesan cheese.\n",
      "Bake in preheated oven until cheese and croutons are golden brown and the chicken is no longer pink inside, about 35 minutes to an hour, depending on the shape and thickness of your chicken breasts. An instant-read thermometer inserted into the thickest part of a chicken breast should read at least 160 degrees F (70 degrees C).\n"
    ],
    "calories": 477,
    "carb": 28,
    "protein": 41,
    "fat": 22
  },
  {
    "url": "https://www.allrecipes.com/recipe/233444/jamaican-style-curry-chicken/",
    "name": "Jamaican Style Curry Chicken",
    "prep": "10 Mins",
    "cook": "45 Mins",
    "ready in": "55 Mins",
    "servings": "4 servings",
    "ingredients": [
      "¼ cup vegetable oil",
      "1 onion, chopped",
      "1 tomato, chopped",
      "1 garlic clove, chopped",
      "2 tablespoons Jamaican-style curry powder",
      "2 slices habanero pepper",
      "¼ teaspoon ground thyme",
      "2 skinless, boneless chicken breast halves, cut into 1 1/2-inch pieces",
      "1 cup water",
      "½ teaspoon salt, or to taste"
    ],
    "directions": [
      "Heat vegetable oil in a skillet over medium-high heat; cook and stir onion, tomato, garlic, curry powder, habanero pepper, and thyme until onion is golden, about 7 minutes. Stir in chicken and cook until chicken is lightly browned, about 5 minutes.\n",
      "Pour water into the skillet, reduce heat to low; cover and simmer until chicken is no longer pink at the center, about 30 minutes. Season with salt.\n"
    ],
    "calories": 210,
    "carb": 7,
    "protein": 13,
    "fat": 16
  },
  {
    "url": "https://www.allrecipes.com/recipe/229658/oven-roasted-turkey-breast/",
    "name": "Oven-Roasted Turkey Breast",
    "prep": "15 Mins",
    "cook": "1 Hours 35 Mins",
    "ready in": "1 Hours 50 Mins",
    "servings": "6 servings",
    "ingredients": [
      "¼ cup butter, softened",
      "1 clove garlic, minced",
      "1 teaspoon paprika",
      "1 teaspoon Italian seasoning",
      "½ teaspoon salt-free garlic and herb seasoning blend (such as Mrs. Dash®)",
      "salt and ground black pepper to taste",
      "1 (3 pound) turkey breast with skin",
      "1 teaspoon minced shallot",
      "1 tablespoon butter",
      "1 splash dry white wine",
      "1 cup chicken stock",
      "3 tablespoons all-purpose flour",
      "2 tablespoons half-and-half"
    ],
    "directions": [
      "Preheat oven to 350 degrees F (175 degrees C).\n",
      "Mix 1/4 cup butter, garlic, paprika, Italian seasoning, garlic and herb seasoning, salt, and black pepper in a bowl. Place turkey breast with skin side up into a roasting pan. Loosen skin with your fingers; brush half the butter mixture over the turkey breast and underneath the skin. Reserve remaining butter mixture. Tent turkey breast loosely with aluminum foil.\n",
      "Roast in the preheated oven for 1 hour; baste turkey breast with remaining butter mixture. Return to oven and roast until the juices run clear and an instant-read meat thermometer inserted into the thickest part of the breast, not touching bone, reads 165 degrees F (65 degrees C), about 30 more minutes. Let turkey breast rest 10 to 15 minutes before serving.\n",
      "While turkey is resting, transfer pan drippings to a skillet. Skim off excess grease, leaving about 1 tablespoon in skillet. Place skillet over low heat; cook and stir shallot in turkey grease until opaque, about 5 minutes. Melt 1 tablespoon butter in skillet with shallot and whisk in white wine, scraping any browned bits of food from skillet. Whisk in chicken stock and flour until smooth. Bring to a simmer, whisking constantly, until thickened. For a creamier, lighter gravy, whisk in half-and-half.\n"
    ],
    "calories": 385,
    "carb": 5,
    "protein": 61,
    "fat": 12
  },
  {
    "url": "https://www.allrecipes.com/recipe/18871/easy-tuna-casserole/",
    "name": "Easy Tuna Casserole",
    "prep": "15 Mins",
    "cook": "30 Mins",
    "ready in": "45 Mins",
    "servings": "8 servings",
    "ingredients": [
      "3 cups cooked macaroni",
      "1 (5 ounce) can tuna, drained",
      "1 (10.75 ounce) can  condensed cream of chicken soup",
      "1 cup shredded Cheddar cheese",
      "1 ½ cups French fried onions"
    ],
    "directions": [
      "Preheat oven to 350 degrees F (175 degrees C).\n",
      "In a 9x13-inch baking dish, combine the macaroni, tuna, and soup. Mix well, and then top with cheese.\n",
      "Bake at 350 degrees F (175 degrees C) for about 25 minutes, or until bubbly. Sprinkle with fried onions, and bake for another 5 minutes. Serve hot.\n"
    ],
    "calories": 463,
    "carb": 38,
    "protein": 12,
    "fat": 29
  },
  {
    "url": "https://www.allrecipes.com/recipe/266136/sheet-pan-chicken-with-mozzarella-pesto-and-broccoli/",
    "name": "Sheet Pan Chicken with Mozzarella, Pesto, and Broccoli",
    "prep": "20 Mins",
    "cook": "15 Mins",
    "ready in": "35 Mins",
    "servings": "8 servings",
    "ingredients": [
      "2 pounds boneless chicken breasts",
      "2 teaspoons garlic salt",
      "1 pinch ground black pepper, or to taste",
      "6 tablespoons pesto",
      "2 Roma (plum) tomatoes, thinly sliced",
      "1 ½ cups shredded mozzarella cheese",
      "1 head broccoli, cut into florets",
      "2 tablespoons olive oil",
      "salt to taste"
    ],
    "directions": [
      "Preheat the oven to 425 degrees F (220 degrees C). Lightly grease a large rimmed baking sheet.\n",
      "Place chicken on the prepared baking sheet and sprinkle with garlic salt and black pepper. Spread pesto over chicken and top with tomatoes and cheese.\n",
      "Toss broccoli and oil together in a bowl. Place broccoli around chicken on the baking sheet. Sprinkle salt and pepper on top.\n",
      "Bake in the preheated oven until broccoli is tender and chicken is no longer pink in the center, 15 to 20 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).\n"
    ],
    "calories": 284,
    "carb": 5,
    "protein": 33,
    "fat": 15
  },
  {
    "url": "https://www.allrecipes.com/recipe/262851/scallops-with-pesto-cream-sauce/",
    "name": "Scallops with Pesto Cream Sauce",
    "prep": "5 Mins",
    "cook": "10 Mins",
    "ready in": "15 Mins",
    "servings": "4 servings",
    "ingredients": [
      "1 pound scallops",
      "salt and freshly ground black pepper to taste",
      "2 tablespoons all-purpose flour",
      "2 tablespoons butter",
      "1 tablespoon pesto",
      "1 tablespoon capers",
      "1 cup heavy whipping cream"
    ],
    "directions": [
      "Season scallops with salt and pepper, then dredge in flour.\n",
      "Melt butter in a skillet over medium heat and add scallops. Cook for 1 to 2 minutes per side. Add pesto and capers; mix well. Stir in heavy cream and bring to a boil. Remove from heat and serve.\n"
    ],
    "calories": 390,
    "carb": 5,
    "protein": 23,
    "fat": 31
  },
  {
    "url": "https://www.allrecipes.com/recipe/14746/mushroom-pork-chops/",
    "name": "Mushroom Pork Chops",
    "prep": "10 Mins",
    "cook": "30 Mins",
    "ready in": "40 Mins",
    "servings": "4 servings",
    "ingredients": [
      "4 pork chops",
      "salt and pepper to taste",
      "1 pinch garlic salt, or to taste",
      "1 onion, chopped",
      "½ pound fresh mushrooms, sliced",
      "1 (10.75 ounce) can  condensed cream of mushroom soup"
    ],
    "directions": [
      "Season pork chops with salt, pepper, and garlic salt to taste.\n",
      "In a large skillet, brown the chops over medium-high heat. Add the onion and mushrooms, and saute for one minute. Pour cream of mushroom soup over chops. Cover skillet, and reduce temperature to medium-low. Simmer 20 to 30 minutes, or until chops are cooked through.\n"
    ],
    "calories": 210,
    "carb": 10,
    "protein": 24,
    "fat": 9
  },
  {
    "url": "https://www.allrecipes.com/recipe/21694/marinated-grilled-shrimp/",
    "name": "Marinated Grilled Shrimp",
    "prep": "15 Mins",
    "cook": "6 Mins",
    "ready in": "55 Mins",
    "servings": "6 servings",
    "ingredients": [
      "3 cloves garlic, minced",
      "⅓ cup olive oil",
      "¼ cup tomato sauce",
      "2 tablespoons red wine vinegar",
      "2 tablespoons chopped fresh basil",
      "½ teaspoon salt",
      "¼ teaspoon cayenne pepper",
      "2 pounds fresh shrimp, peeled and deveined",
      "6 each skewers"
    ],
    "directions": [
      "In a large bowl, stir together the garlic, olive oil, tomato sauce, and red wine vinegar. Season with basil, salt, and cayenne pepper. Add shrimp to the bowl, and stir until evenly coated. Cover, and refrigerate for 30 minutes to 1 hour, stirring once or twice.\n",
      "Preheat grill for medium heat. Thread shrimp onto skewers, piercing once near the tail and once near the head. Discard marinade.\n",
      "Lightly oil grill grate. Cook shrimp on preheated grill for 2 to 3 minutes per side, or until opaque.\n"
    ],
    "calories": 273,
    "carb": 3,
    "protein": 31,
    "fat": 15
  },
  {
    "url": "https://www.allrecipes.com/recipe/239137/three-ingredient-baked-chicken-breasts/",
    "name": "Three-Ingredient Baked Chicken Breasts",
    "prep": "10 Mins",
    "cook": "30 Mins",
    "ready in": "40 Mins",
    "servings": "4 servings",
    "ingredients": [
      "¼ cup butter, melted",
      "1 teaspoon salt",
      "4 skinless, boneless chicken breast halves"
    ],
    "directions": [
      "Preheat oven to 350 degrees F (175 degrees C). Lightly butter a baking dish.\n",
      "Stir 1/4 cup melted butter and salt together in a bowl.\n",
      "Arrange chicken in the baking dish. Brush butter mixture onto the chicken until thoroughly coated, pouring any extra over the chicken.\n",
      "Bake in the preheated oven until no longer pink in the center and the juices run clear, about 30 to 45 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).\n"
    ],
    "calories": 228,
    "carb": "n/a",
    "protein": 24,
    "fat": 15
  },
  {
    "url": "https://www.allrecipes.com/recipe/46822/indian-chicken-curry-ii/",
    "name": "Indian Chicken Curry II",
    "prep": "20 Mins",
    "cook": "25 Mins",
    "ready in": "45 Mins",
    "servings": "4 to 6 servings",
    "ingredients": [
      "3 tablespoons olive oil",
      "1 small onion, chopped",
      "2 cloves garlic, minced",
      "3 tablespoons curry powder",
      "1 teaspoon ground cinnamon",
      "1 teaspoon paprika",
      "1 bay leaf",
      "½ teaspoon grated fresh ginger root",
      "½ teaspoon white sugar",
      "salt to taste",
      "2 skinless, boneless chicken breast halves - cut into bite-size pieces",
      "1 tablespoon tomato paste",
      "1 cup plain yogurt",
      "¾ cup coconut milk",
      "½ lemon, juiced",
      "½ teaspoon cayenne pepper"
    ],
    "directions": [
      "Heat olive oil in a skillet over medium heat. Saute onion until lightly browned. Stir in garlic, curry powder, cinnamon, paprika, bay leaf, ginger, sugar and salt. Continue stirring for 2 minutes. Add chicken pieces, tomato paste, yogurt, and coconut milk. Bring to a boil, reduce heat, and simmer for 20 to 25 minutes.\n",
      "Remove bay leaf, and stir in lemon juice and cayenne pepper. Simmer 5 more minutes.\n"
    ],
    "calories": 313,
    "carb": 14,
    "protein": 20,
    "fat": 22
  },
  {
    "url": "https://www.allrecipes.com/recipe/236432/brown-sugar-ham-steak/",
    "name": "Brown Sugar Ham Steak",
    "prep": "10 Mins",
    "cook": "15 Mins",
    "ready in": "25 Mins",
    "servings": "2 servings",
    "ingredients": [
      "1 (8 ounce) bone-in fully cooked ham steak",
      "5 tablespoons butter, cubed",
      "5 tablespoons brown sugar"
    ],
    "directions": [
      "Cook ham steak in a large skillet over medium heat until browned, 3 to 4 minutes per side. Drain and remove ham.\n",
      "Heat butter in the same skillet until melted; stir in brown sugar. Return ham to skillet and cook over medium-low heat until heated through and brown sugar is dissolved, turning steak often, about 10 minutes.\n"
    ],
    "calories": 522,
    "carb": 34,
    "protein": 23,
    "fat": 34
  },
  {
    "url": "https://www.allrecipes.com/recipe/279837/cheesy-chicken-and-broccoli-casserole/",
    "name": "Cheesy Chicken and Broccoli Casserole",
    "prep": "15 Mins",
    "cook": "35 Mins",
    "ready in": "50 Mins",
    "servings": "1 9x13-inch casserole",
    "ingredients": [
      "1 teaspoon unsalted butter, or as needed",
      "2 skinless, boneless chicken breasts, cubed",
      "3 cups finely chopped broccoli",
      "2 (10.5 ounce) cans condensed cream of chicken soup",
      "1 cup shredded Cheddar cheese",
      "1 cup shredded Parmesan cheese, divided",
      "½ cup shredded mozzarella cheese",
      "½ cup sour cream",
      "ground black pepper to taste"
    ],
    "directions": [
      "Preheat the oven to 350 degrees F (175 degrees C). Butter the bottom and sides of a 9x13-inch dish.\n",
      "Bring a pot of water to a boil. Add chicken and continue to boil until no longer pink, 5 to 10 minutes.\n",
      "Meanwhile, combine broccoli, cream of chicken soup, Cheddar cheese, 1/2 cup Parmesan cheese, mozzarella cheese, sour cream, and pepper in a large bowl. Mix well.\n",
      "Drain chicken and add to broccoli mixture. Mix well. Pour into the prepared baking dish and spread evenly.\n",
      "Bake in the preheated oven for 20 minutes. Add remaining Parmesan cheese on top and continue to bake until cheese is melted, 3 to 5 minutes.\n"
    ],
    "calories": 266,
    "carb": 10,
    "protein": 19,
    "fat": 18
  },
  {
    "url": "https://www.allrecipes.com/recipe/134483/chicago-style-hot-dog/",
    "name": "Chicago-Style Hot Dog",
    "prep": "10 Mins",
    "cook": "5 Mins",
    "ready in": "15 Mins",
    "servings": "1 hot dog",
    "ingredients": [
      "1 all-beef hot dog",
      "1 poppyseed hot dog bun",
      "1 tablespoon yellow mustard",
      "1 tablespoon sweet green pickle relish",
      "1 tablespoon chopped onion",
      "4 tomato wedges",
      "1 dill pickle spear",
      "2 sport peppers",
      "1 dash celery salt"
    ],
    "directions": [
      "Bring a pot of water to a boil. Reduce heat to low, place hot dog in water, and cook 5 minutes or until done. Remove hot dog and set aside. Carefully place a steamer basket into the pot and steam the hot dog bun 2 minutes or until warm.\n",
      "Place hot dog in the steamed bun. Pile on the toppings in this order: yellow mustard, sweet green pickle relish, onion, tomato wedges, pickle spear, sport peppers, and celery salt.  The tomatoes should be nestled between the hot dog and the top of the bun.  Place the pickle between the hot dog and the bottom of the bun. Don't even think about ketchup!\n"
    ],
    "calories": 377,
    "carb": 38,
    "protein": 13,
    "fat": 20
  },
  {
    "url": "https://www.allrecipes.com/recipe/50233/black-pepper-beef-and-cabbage-stir-fry/",
    "name": "Black Pepper Beef and Cabbage Stir Fry",
    "prep": "15 Mins",
    "cook": "15 Mins",
    "ready in": "30 Mins",
    "servings": "4 servings",
    "ingredients": [
      "2 tablespoons vegetable oil",
      "4 cloves garlic, chopped",
      "½ pound ground beef",
      "½ small head cabbage, shredded",
      "1 red bell pepper, cut into strips",
      "2 tablespoons soy sauce",
      "1 teaspoon cornstarch",
      "½ cup cold water",
      "1 teaspoon ground black pepper, or to taste",
      "1 pinch salt, to taste"
    ],
    "directions": [
      "Heat a wok or large skillet over medium-high heat, and add oil. Saute garlic for about 5 seconds, then add ground beef. Stir-fry until beef is evenly brown, 5 to 7 minutes; drain excess fat.\n",
      "Stir in cabbage and pepper, and cook until vegetables are tender and beef is fully cooked. Stir in soy sauce. Mix together cornstarch and water, and stir in. Season with pepper; add salt to taste. Cook, stirring, until sauce has thickened.\n"
    ],
    "calories": 281,
    "carb": 10,
    "protein": 12,
    "fat": 23
  },
  {
    "url": "https://www.allrecipes.com/recipe/222585/baked-chicken-and-zucchini/",
    "name": "Baked Chicken and Zucchini",
    "prep": "20 Mins",
    "cook": "30 Mins",
    "ready in": "50 Mins",
    "servings": "4 servings",
    "ingredients": [
      "1 egg",
      "1 tablespoon water",
      "½ teaspoon salt",
      "⅛ teaspoon ground black pepper",
      "1 cup dry bread crumbs",
      "2 tablespoons olive oil",
      "4 skinless, boneless chicken breast halves",
      "1 tablespoon minced garlic",
      "2 tablespoons olive oil",
      "5 zucchinis, sliced",
      "4 tomatoes, sliced",
      "⅔ cup shredded mozzarella cheese",
      "2 teaspoons chopped fresh basil",
      "⅓ cup shredded mozzarella cheese"
    ],
    "directions": [
      "Preheat oven to 400 degrees F (205 degrees C). Lightly grease a 9x13-inch baking dish.\n",
      "Beat egg, water, salt, and pepper in a shallow bowl. Set 2 tablespoons bread crumbs aside; pour remaining bread crumbs into a large resealable plastic bag. Dip chicken in egg mixture, then place in bag and shake to coat.\n",
      "Heat 2 tablespoons olive oil in a large skillet over medium heat. Cook chicken in skillet until browned, 2 to 3 minutes per side. Remove chicken from pan. Add remaining 2 tablespoons oil to skillet; cook and stir zucchini and garlic over medium heat until zucchini is slightly tender, about 2 minutes. Transfer to prepared baking dish.\n",
      "Sprinkle 2 tablespoons reserved bread crumbs over zucchini. Top with tomato slices, 2/3 cup mozzarella cheese, and basil. Place chicken on top of zucchini layer. Cover baking dish with aluminum foil.\n",
      "Bake in preheated oven until chicken is no longer pink in the center and juices run clear, about 25 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C). Uncover and sprinkle with remaining mozzarella cheese. Bake until cheese is melted, about 5 minutes.\n"
    ],
    "calories": 506,
    "carb": 35,
    "protein": 40,
    "fat": 25
  },
  {
    "url": "https://www.allrecipes.com/recipe/254819/taco-bake-casserole/",
    "name": "Taco Bake Casserole",
    "prep": "20 Mins",
    "cook": "32 Mins",
    "ready in": "52 Mins",
    "servings": "12 servings",
    "ingredients": [
      "cooking spray (such as Pam®)",
      "1 ½ pounds ground beef",
      "1 cup chopped onion",
      "½ cup water",
      "1 (1 ounce) package taco seasoning mix",
      "1 (10 ounce) can refried beans",
      "½ cup salsa",
      "1 (6 ounce) can sliced black olives",
      "1 (4 ounce) can diced green chiles",
      "15 taco shells, broken up, or more to taste",
      "2 cups shredded Cheddar cheese"
    ],
    "directions": [
      "Preheat oven to 375 degrees F (190 degrees C). Spray a 9x13-inch baking pan with cooking spray.\n",
      "Cook ground beef and onions in a skillet over medium heat until beef is browned, 7 to 10 minutes; drain grease. Stir in water and taco seasoning; cook, stirring often, until thickened, about 2 minutes. Add refried beans, salsa, olives, and green chiles. Cook and stir over low heat until ingredients are warmed through, 3 to 4 minutes.\n",
      "Place half of the taco shells in the bottom of the baking dish. Pour in half of the ground beef mixture; sprinkle with half of the Cheddar cheese. Repeat with remaining taco shells, ground beef mixture, and Cheddar cheese.\n",
      "Bake in the preheated oven until cheese is melted and bubbly, 20 to 25 minutes.\n"
    ],
    "calories": 360,
    "carb": 21,
    "protein": 21,
    "fat": 22
  },
  {
    "url": "https://www.allrecipes.com/recipe/85127/kielbasa-with-peppers-and-potatoes/",
    "name": "Kielbasa with Peppers and Potatoes",
    "prep": "10 Mins",
    "cook": "30 Mins",
    "ready in": "40 Mins",
    "servings": "6 servings",
    "ingredients": [
      "1 tablespoon vegetable oil",
      "1 (16 ounce) package smoked kielbasa sausage, diced",
      "6 medium red potatoes, diced",
      "1 red bell pepper, sliced",
      "1 yellow bell pepper, sliced"
    ],
    "directions": [
      "Heat the oil in a saucepan over medium heat. Place kielbasa and potatoes in the saucepan. Cover, and cook 25 minutes, stirring occasionally, until potatoes are tender.\n",
      "Mix red bell pepper and yellow bell pepper into the saucepan, and continue cooking 5 minutes, until peppers are just tender.\n"
    ],
    "calories": 404,
    "carb": 37,
    "protein": 14,
    "fat": 24
  },
  {
    "url": "https://www.allrecipes.com/recipe/244950/baked-chicken-schnitzel/",
    "name": "Baked Chicken Schnitzel",
    "prep": "20 Mins",
    "cook": "10 Mins",
    "ready in": "30 Mins",
    "servings": "6 servings",
    "ingredients": [
      "1 tablespoon olive oil, or as desired",
      "6 chicken breasts, cut in half lengthwise (butterflied)",
      "salt and ground black pepper to taste",
      "¾ cup all-purpose flour",
      "1 tablespoon paprika",
      "2 eggs, beaten",
      "2 cups seasoned bread crumbs",
      "1 large lemon, zested"
    ],
    "directions": [
      "Preheat oven to 425 degrees F (220 degrees C). Line a large baking sheet with aluminum foil and drizzle olive oil over foil. Place baking sheet in preheated oven.\n",
      "Flatten chicken breasts so they are all about 1/4-inch thick. Season chicken with salt and pepper.\n",
      "Mix flour and paprika together on a large plate. Beat eggs with salt and pepper in a shallow bowl. Mix bread crumbs and lemon zest together on a separate large plate. Dredge each chicken piece in flour mixture, then egg, and then bread crumbs mixture and set aside in 1 layer on a clean plate. Repeat with remaining chicken.\n",
      "Remove baking sheet from oven and arrange chicken in 1 layer on the sheet. Drizzle more olive oil over each piece of coated chicken.\n",
      "Bake in the preheated oven for 5 to 6 minutes. Flip chicken and continue baking until no longer pink in the center and the breading is lightly browned, 5 to 6 minutes more. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).\n"
    ],
    "calories": 383,
    "carb": 41,
    "protein": 34,
    "fat": 10
  },
  {
    "url": "https://www.allrecipes.com/recipe/14554/sirloin-steak-with-garlic-butter/",
    "name": "Sirloin Steak with Garlic Butter",
    "prep": "20 Mins",
    "cook": "10 Mins",
    "ready in": "30 Mins",
    "servings": "8 servings",
    "ingredients": [
      "½ cup butter",
      "2 teaspoons garlic powder",
      "4 cloves garlic, minced",
      "4 pounds beef top sirloin steaks",
      "salt and pepper to taste"
    ],
    "directions": [
      "Preheat an outdoor grill for high heat.\n",
      "In a small saucepan, melt butter over medium-low heat with garlic powder and minced garlic. Set aside.\n",
      "Sprinkle both sides of each steak with salt and pepper.\n",
      "Grill steaks 4 to 5 minutes per side, or to desired doneness. When done, transfer to warmed plates. Brush tops liberally with garlic butter, and allow to rest for 2 to 3 minutes before serving.\n"
    ],
    "calories": 453,
    "carb": 1,
    "protein": 38,
    "fat": 33
  },
  {
    "url": "https://www.allrecipes.com/recipe/231549/baked-flounder-with-panko-and-parmesan/",
    "name": "Baked Flounder with Panko and Parmesan",
    "prep": "10 Mins",
    "cook": "15 Mins",
    "ready in": "25 Mins",
    "servings": "4 servings",
    "ingredients": [
      "4 (4 ounce) flounder fillets",
      "¼ cup butter, melted",
      "⅔ cup grated Parmesan cheese",
      "1 cup panko bread crumbs",
      "½ teaspoon salt",
      "ground black pepper to taste",
      "1 pinch dried thyme"
    ],
    "directions": [
      "Preheat oven to 400 degrees F (200 degrees C). Lightly grease a large, shallow baking dish.\n",
      "Arrange flounder fillets on prepared baking dish and brush with 1 tablespoon butter. Combine remaining 3 tablespoons butter with bread crumbs, Parmesan cheese, salt, pepper, and thyme in a bowl; sprinkle over flounder.\n",
      "Bake in preheated oven until fish flakes easily with a fork, 15 to 20 minutes. Carefully transfer fillets to a plate with a spatula.\n"
    ],
    "calories": 332,
    "carb": 20,
    "protein": 30,
    "fat": 18
  },
  {
    "url": "https://www.allrecipes.com/recipe/11951/linguine-with-clam-sauce/",
    "name": "Linguine with Clam Sauce",
    "prep": "20 Mins",
    "cook": "12 Mins",
    "ready in": "32 Mins",
    "servings": "4 servings",
    "ingredients": [
      "2 (6.5 ounce) cans minced clams, with juice",
      "¼ cup butter",
      "½ cup vegetable oil",
      "½ teaspoon minced garlic",
      "1 tablespoon dried parsley",
      "ground black pepper to taste",
      "¼ tablespoon dried basil",
      "1 (16 ounce) package linguini pasta"
    ],
    "directions": [
      "Bring a large pot of salted water to boil. Cook pasta according to package directions.\n",
      "Combine clams with juice, butter, oil, minced garlic, parsley, basil, and pepper in a large saucepan. Place over medium heat until boiling. Serve warm over pasta.\n"
    ],
    "calories": 879,
    "carb": 85,
    "protein": 38,
    "fat": 43
  },
  {
    "url": "https://www.allrecipes.com/recipe/265979/air-fryer-baked-potatoes/",
    "name": "Air Fryer Baked Potatoes",
    "prep": "5 Mins",
    "cook": "1 Hours 0 Mins",
    "ready in": "1 Hours 5 Mins",
    "servings": "2 baked potatoes",
    "ingredients": [
      "2 large russet potatoes, scrubbed",
      "1 tablespoon peanut oil",
      "½ teaspoon coarse sea salt"
    ],
    "directions": [
      "Preheat air fryer to 400 degrees F (200 degrees C).\n",
      "Brush potatoes with peanut oil and sprinkle with salt. Place them in the air fryer basket and place basket in the air fryer.\n",
      "Cook potatoes until done, about 1 hour. Test for doneness by piercing them with a fork.\n"
    ],
    "calories": 344,
    "carb": 65,
    "protein": 8,
    "fat": 8
  },
  {
    "url": "https://www.allrecipes.com/recipe/36621/philly-steak-sandwich/",
    "name": "Philly Steak Sandwich",
    "prep": "15 Mins",
    "cook": "25 Mins",
    "ready in": "40 Mins",
    "servings": "4 servings",
    "ingredients": [
      "1 pound beef sirloin, cut into thin 2 inch strips",
      "½ teaspoon salt",
      "½ teaspoon black pepper",
      "½ teaspoon paprika",
      "½ teaspoon chili powder",
      "½ teaspoon onion powder",
      "½ teaspoon garlic powder",
      "½ teaspoon dried thyme",
      "½ teaspoon dried marjoram",
      "½ teaspoon dried basil",
      "3 tablespoons vegetable oil",
      "1 onion, sliced",
      "1 green bell pepper, julienned",
      "3 ounces Swiss cheese, thinly sliced",
      "4 hoagie rolls, split lengthwise"
    ],
    "directions": [
      "Place the beef in a large bowl. In a small bowl, mix together salt, pepper, paprika, chili powder, onion powder, garlic powder, thyme, marjoram and basil. Sprinkle over beef.\n",
      "Heat half of the oil in a skillet over medium-high heat. Saute beef to desired doneness, and remove from pan. Heat the remaining oil in the skillet, and saute the onion and green pepper.\n",
      "Preheat oven on broiler setting.\n",
      "Divide the meat between the bottoms of 4 rolls, layer with onion and green pepper, then top with sliced cheese. Place on cookie sheet, and broil until cheese is melted. Cover with tops of rolls, and serve.\n"
    ],
    "calories": 641,
    "carb": 40,
    "protein": 36,
    "fat": 39
  },
  {
    "url": "https://www.allrecipes.com/recipe/52005/tender-italian-baked-chicken/",
    "name": "Tender Italian Baked Chicken",
    "prep": "10 Mins",
    "cook": "20 Mins",
    "ready in": "30 Mins",
    "servings": "4 servings",
    "ingredients": [
      "¾ cup mayonnaise",
      "½ cup grated Parmesan cheese",
      "¾ teaspoon garlic powder",
      "¾ cup Italian seasoned bread crumbs",
      "4 skinless, boneless chicken breast halves"
    ],
    "directions": [
      "Preheat oven to 425 degrees F (220 degrees C).\n",
      "In a bowl, mix the mayonnaise, Parmesan cheese, and garlic powder. Place bread crumbs in a separate bowl. Dip chicken into the mayonnaise mixture, then into the bread crumbs to coat. Arrange coated chicken on a baking sheet.\n",
      "Bake 20 minutes in the preheated oven, or until chicken juices run clear and coating is golden brown.\n"
    ],
    "calories": 554,
    "carb": 18,
    "protein": 32,
    "fat": 40
  },
  {
    "url": "https://www.allrecipes.com/recipe/239047/one-pan-orecchiette-pasta/",
    "name": "One Pan Orecchiette Pasta",
    "prep": "15 Mins",
    "cook": "25 Mins",
    "ready in": "40 Mins",
    "servings": "2 servings",
    "ingredients": [
      "2 tablespoons olive oil",
      "½ onion, diced",
      "salt to taste",
      "8 ounces spicy Italian sausages, casings removed",
      "3 ½ cups low-sodium chicken broth, divided, or as needed",
      "1 ¼ cups orecchiette pasta, or more to taste",
      "½ cup roughly chopped arugula, or to taste",
      "¼ cup finely grated Parmigiano-Reggiano cheese, or to taste"
    ],
    "directions": [
      "Heat olive oil in a large, deep skillet over medium heat. Cook and stir onion with a pinch of salt in hot oil until onion is soft and golden, 5 to 7 minutes. Stir sausage into onions; cook and stir until sausage is broken up and browned, 5 to 7 minutes.\n",
      "Pour 1 1/2 cups chicken broth into sausage mixture and bring to a boil while scraping the browned bits of food off of the bottom of the pan with a wooden spoon. Add orecchiette pasta; cook and stir pasta in hot broth, adding remaining broth when liquid is absorbed, until pasta is cooked through and most of the broth is absorbed, about 15 minutes.\n",
      "Stir arugula into pasta-sausage mixture until arugula wilts. Ladle pasta into bowls and dust with Parmigiano-Reggiano cheese.\n"
    ],
    "calories": 662,
    "carb": 47,
    "protein": 32,
    "fat": 40
  },
  {
    "url": "https://www.allrecipes.com/recipe/236814/baked-fresh-rainbow-trout/",
    "name": "Baked Fresh Rainbow Trout",
    "prep": "10 Mins",
    "cook": "20 Mins",
    "ready in": "30 Mins",
    "servings": "6 servings",
    "ingredients": [
      "2 teaspoons olive oil, or to taste",
      "2 whole rainbow trout, gutted and cleaned, heads and tails still on",
      "¼ teaspoon dried dill weed",
      "¼ teaspoon dried thyme",
      "salt and freshly ground black pepper to taste",
      "½ large onion, sliced",
      "2 thin slices lemon",
      "2 tablespoons hot water"
    ],
    "directions": [
      "Preheat oven to 400 degrees F (200 degrees C). Grease a 9x13-inch baking dish with about 1 teaspoon olive oil.\n",
      "Place trout in the prepared baking dish and coat with remaining olive oil. Season the inside and outside of fish with dill, thyme, and salt. Stuff each fish with onion slices; grind pepper over the top. Place 1 lemon slice on each fish.\n",
      "Bake in the preheated oven for 10 minutes; add water to dish. Continue baking until fish flake easily with a fork, about 10 minutes more.\n"
    ],
    "calories": 373,
    "carb": 2,
    "protein": 55,
    "fat": 16
  },
  {
    "url": "https://www.allrecipes.com/recipe/209578/blt/",
    "name": "BLT",
    "prep": "5 Mins",
    "cook": "10 Mins",
    "ready in": "15 Mins",
    "servings": "1 sandwich",
    "ingredients": [
      "4 slices bacon",
      "2 leaves lettuce",
      "2 slices tomato",
      "2 slices bread, toasted",
      "1 tablespoon mayonnaise"
    ],
    "directions": [
      "Cook the bacon in a large, deep skillet over medium-high heat until evenly browned, about 10 minutes. Drain the bacon slices on a paper towel-lined plate.\n",
      "Arrange the cooked bacon, lettuce, and tomato slices on one slice of bread. Spread one side of remaining bread slice with the mayonnaise. Bring the two pieces together to make a sandwich.\n"
    ],
    "calories": 439,
    "carb": 29,
    "protein": 18,
    "fat": 28
  },
  {
    "url": "https://www.allrecipes.com/recipe/8847/baked-honey-mustard-chicken/",
    "name": "Baked Honey Mustard Chicken",
    "prep": "15 Mins",
    "cook": "45 Mins",
    "ready in": "60 Mins",
    "servings": "6 servings",
    "ingredients": [
      "6 skinless, boneless chicken breast halves",
      "salt and pepper to taste",
      "½ cup honey",
      "½ cup prepared mustard",
      "1 teaspoon dried basil",
      "1 teaspoon paprika",
      "½ teaspoon dried parsley"
    ],
    "directions": [
      "Preheat oven to 350 degrees F (175 degrees C).\n",
      "Sprinkle chicken breasts with salt and pepper to taste, and place in a lightly greased 9x13 inch baking dish. In a small bowl, combine the honey, mustard, basil, paprika, and parsley. Mix well. Pour 1/2 of this mixture over the chicken, and brush to cover.\n",
      "Bake in the preheated oven for 30 minutes. Turn chicken pieces over and brush with the remaining 1/2 of the honey mustard mixture. Bake for an additional 10 to 15 minutes, or until chicken is no longer pink and juices run clear. Let cool 10 minutes before serving.\n"
    ],
    "calories": 232,
    "carb": 25,
    "protein": 26,
    "fat": 4
  },
  {
    "url": "https://www.allrecipes.com/recipe/273213/crispy-beer-batter-fish-chips/",
    "name": "Crispy Beer Batter Fish & Chips",
    "prep": "15 Mins",
    "cook": "10 Mins",
    "ready in": "25 Mins",
    "servings": "4 servings",
    "ingredients": [
      "1 cup self-rising flour",
      "2 tablespoons rice flour",
      "¼ teaspoon baking powder",
      "4 (6 ounce) cod fillets, fully thawed if frozen",
      "2 tablespoons rice flour, or as needed",
      "salt to taste",
      "1 cup lager-style beer, or more as needed",
      "vegetable oil for frying"
    ],
    "directions": [
      "Whisk self-rising flour, rice flour, and baking powder together in a bowl. Freeze until ready to use.\n",
      "Pat fish as dry as possible. Cut pieces lengthwise to get eight 1-inch thick strips. Place rice flour on a plate and season with salt. Dust fish lightly with the mixture and shake off excess. Cover a plate with crinkled foil to make a quick drying rack; place fish on top.\n",
      "Heat oil in a deep-fryer to 375 degrees F (190 degrees C).\n",
      "Pour beer into the flour mixture and whisk, adding more as needed, until batter is the consistency of thick pancake batter. Dip fish pieces into the batter to coat; lift out and let excess drip off.\n",
      "Fry fish in batches until golden brown, dunking occasionally if needed, 3 to 4 minutes. Drain on paper towels. Serve immediately.\n"
    ],
    "calories": 504,
    "carb": 43,
    "protein": 28,
    "fat": 23
  },
  {
    "url": "https://www.allrecipes.com/recipe/201849/mongolian-beef-and-spring-onions/",
    "name": "Mongolian Beef and Spring Onions",
    "prep": "12 Mins",
    "cook": "8 Mins",
    "ready in": "30 Mins",
    "servings": "4 servings",
    "ingredients": [
      "2 teaspoons vegetable oil",
      "1 tablespoon finely chopped garlic",
      "½ teaspoon grated fresh ginger root",
      "½ cup soy sauce",
      "½ cup water",
      "⅔ cup dark brown sugar",
      "1 pound beef flank steak, sliced 1/4 inch thick on the diagonal",
      "¼ cup cornstarch",
      "1 cup vegetable oil for frying",
      "2 bunches green onions, cut in 2-inch lengths"
    ],
    "directions": [
      "Heat 2 teaspoons of vegetable oil in a saucepan over medium heat, and cook and stir the garlic and ginger until they release their fragrance, about 30 seconds. Pour in the soy sauce, water, and brown sugar. Raise the heat to medium-high, and stir 4 minutes, until the sugar has dissolved and the sauce boils and slightly thickens. Remove sauce from the heat, and set aside.\n",
      "Place the sliced beef into a bowl, and stir the cornstarch into the beef, coating it thoroughly. Allow the beef and cornstarch to sit until most of the juices from the meat have been absorbed by the cornstarch, about 10 minutes.\n",
      "Heat the vegetable oil in a deep-sided skillet or wok to 375 degrees F (190 degrees C).\n",
      "Shake excess cornstarch from the beef slices, and drop them into the hot oil, a few at a time. Stir briefly, and fry until the edges become crisp and start to brown, about 2 minutes. Remove the beef from the oil with a large slotted spoon, and allow to drain on paper towels to remove excess oil.\n",
      "Pour the oil out of the skillet or wok, and return the pan to medium heat. Return the beef slices to the pan, stir briefly, and pour in the reserved sauce. Stir once or twice to combine, and add the green onions. Bring the mixture to a boil, and cook until the onions have softened and turned bright green, about 2 minutes.\n"
    ],
    "calories": 391,
    "carb": 55,
    "protein": 18,
    "fat": 13
  },
  {
    "url": "https://www.allrecipes.com/recipe/231939/honey-glazed-chicken/",
    "name": "Honey Glazed Chicken",
    "prep": "10 Mins",
    "cook": "10 Mins",
    "ready in": "20 Mins",
    "servings": "4 servings",
    "ingredients": [
      "¼ cup honey",
      "2 tablespoons soy sauce",
      "⅛ teaspoon red pepper flakes",
      "1 ½ tablespoons olive oil",
      "2 skinless, boneless chicken breast halves, cut into bite-size pieces"
    ],
    "directions": [
      "Whisk honey, soy sauce, and red pepper flakes in a bowl.\n",
      "Heat olive oil in a skillet over medium heat; cook and stir chicken in hot oil until lightly brown, about 5 minutes. Pour honey mixture into skillet and continue to cook and stir until chicken is no longer pink in the center and sauce is thickened, about 5 minutes more.\n"
    ],
    "calories": 179,
    "carb": 19,
    "protein": 13,
    "fat": 7
  },
  {
    "url": "https://www.allrecipes.com/recipe/216757/savory-sea-scallops-and-angel-hair-pasta/",
    "name": "Savory Sea Scallops and Angel Hair Pasta",
    "prep": "25 Mins",
    "cook": "5 Mins",
    "ready in": "30 Mins",
    "servings": "6 servings",
    "ingredients": [
      "1 (16 ounce) package angel hair pasta",
      "¼ cup butter",
      "2 cloves garlic, minced",
      "2 pounds sea scallops, rinsed and patted dry",
      "3 tablespoons chopped fresh basil",
      "2 tablespoons chopped fresh flat-leaf parsley",
      "2 tablespoons fresh lemon juice",
      "salt and freshly ground black pepper to taste",
      "½ cup heavy cream",
      "1 tablespoon grated Parmesan cheese to taste"
    ],
    "directions": [
      "Fill a large pot with lightly salted water and bring to a rolling boil over high heat. Once the water is boiling, stir in the angel hair pasta, and return to a boil. Cook the pasta uncovered, stirring occasionally, until the pasta has cooked through, but is still firm to the bite, 4 to 5 minutes. Drain well in a colander set in the sink.\n",
      "Melt butter in a skillet over medium heat. Stir in the garlic and cook just until fragrant and softened, about 1 minute. Slice any scallops over 3/4-inch thick in half so they'll cook evenly; stir scallops, basil, and parsley into the skillet. Cook and gently stir just until scallops feel slightly firm when pressed with a finger, 2 to 3 minutes. Scallops will become tough and chewy if overcooked. Stir in lemon juice, and season with salt and black pepper. Pour in cream if you like a thicker sauce. Bring the mixture just to a bare simmer.\n",
      "Serve over hot angel hair pasta; sprinkle to taste with Parmesan cheese.\n"
    ],
    "calories": 516,
    "carb": 47,
    "protein": 34,
    "fat": 22
  },
  {
    "url": "https://www.allrecipes.com/recipe/261600/sheet-pan-lemon-butter-garlic-shrimp-with-asparagus/",
    "name": "Sheet Pan Lemon Butter Garlic Shrimp with Asparagus",
    "prep": "10 Mins",
    "cook": "12 Mins",
    "ready in": "22 Mins",
    "servings": "4 servings",
    "ingredients": [
      "cooking spray",
      "1 pound fresh asparagus, trimmed",
      "2 tablespoons olive oil, divided",
      "4 cloves garlic, minced",
      "salt, divided",
      "1 pinch ground black pepper, divided",
      "1 ½ pounds uncooked medium shrimp, peeled and deveined",
      "1 teaspoon paprika",
      "3 tablespoons butter, cubed",
      "3 tablespoons lemon juice"
    ],
    "directions": [
      "Preheat oven to 400 degrees F (200 degrees C). Line a rimmed 9x12-inch baking pan with parchment paper and grease with cooking spray.\n",
      "Place asparagus on the prepared baking pan and drizzle with 1 tablespoon olive oil. Sprinkle with garlic, 1 teaspoon salt, and 1/2 teaspoon pepper; toss until well coated. Arrange asparagus in a single layer.\n",
      "Bake in the preheated oven until slightly tender, about 6 minutes.\n",
      "Remove from oven and place shrimp on one side of the pan. Drizzle with remaining 1 tablespoon olive oil, 1 teaspoon salt, 1/2 teaspoon pepper, and smoked paprika; toss until well coated. Place shrimp in a single layer next to the asparagus. Top asparagus and shrimp with cubed butter.\n",
      "Roast in the preheated oven until shrimp is opaque, about 6 minutes.\n",
      "Remove pan from oven and drizzle with lemon juice.\n"
    ],
    "calories": 301,
    "carb": 7,
    "protein": 31,
    "fat": 18
  },
  {
    "url": "https://www.allrecipes.com/recipe/21862/barbecue-beef-cups/",
    "name": "Barbecue Beef Cups",
    "prep": "15 Mins",
    "cook": "25 Mins",
    "ready in": "40 Mins",
    "servings": "6 servings",
    "ingredients": [
      "¾ pound lean ground beef",
      "½ cup barbeque sauce",
      "1 tablespoon dried minced onion",
      "1 (12 ounce) package refrigerated biscuit dough",
      "⅓ cup shredded Cheddar cheese"
    ],
    "directions": [
      "Preheat oven to 350 degrees F (175 degrees C).  Grease the cups of a muffin pan.\n",
      "In a large heavy skillet over medium heat, cook beef until evenly brown. Drain excess fat. Stir in barbeque sauce and dried onion. Simmer for a few minutes over low heat.\n",
      "Flatten each biscuit, and press into cups of the prepared muffin pan. Make sure the dough comes to the top of the pan. Spoon a portion of the meat mixture into each dough cup.\n",
      "Bake in preheated oven for 12 minutes. Sprinkle with cheese, and bake for 3 more minutes.\n"
    ],
    "calories": 353,
    "carb": 33,
    "protein": 17,
    "fat": 18
  },
  {
    "url": "https://www.allrecipes.com/recipe/269366/simple-sauteed-sesame-chicken/",
    "name": "Simple Sauteed Sesame Chicken",
    "prep": "10 Mins",
    "cook": "10 Mins",
    "ready in": "20 Mins",
    "servings": "6 servings",
    "ingredients": [
      "4 large chicken breast halves",
      "1 teaspoon salt",
      "1 teaspoon ground black pepper",
      "2 tablespoons all-purpose flour",
      "1 teaspoon red pepper flakes",
      "1 teaspoon garlic powder",
      "½ teaspoon onion powder",
      "3 tablespoons low-sodium soy sauce",
      "2 tablespoons sesame oil",
      "2 teaspoons honey",
      "1 tablespoon olive oil"
    ],
    "directions": [
      "Cut chicken breasts into 1 1/2-inch slices about 1/4-inch thick. Season with salt and pepper. Combine flour, red pepper flakes, garlic powder, and onion powder in a large bowl. Add chicken and toss well. Add soy sauce, sesame oil, and honey; stir to coat.\n",
      "Heat olive oil in a skillet over medium-high heat. Add chicken and cook, stirring occasionally, until golden brown and juices run clear, 10 to 15 minutes.\n"
    ],
    "calories": 254,
    "carb": 6,
    "protein": 33,
    "fat": 11
  },
  {
    "url": "https://www.allrecipes.com/recipe/200036/southern-fried-chicken-livers/",
    "name": "Southern Fried Chicken Livers",
    "prep": "10 Mins",
    "cook": "10 Mins",
    "ready in": "20 Mins",
    "servings": "4 servings",
    "ingredients": [
      "1 pound chicken livers",
      "1 egg",
      "½ cup milk",
      "1 cup all-purpose flour",
      "1 tablespoon garlic powder",
      "salt and pepper to taste",
      "1 quart vegetable oil for frying"
    ],
    "directions": [
      "Place the chicken livers in a colander, and rinse with water. Drain the livers well. Whisk together the egg and milk in a shallow bowl until well blended. Place the flour, garlic powder, and salt and pepper in a resealable plastic zipper bag, and shake to combine.\n",
      "Heat oil in a deep-fryer or large saucepan to 375 degrees F (190 degrees C).\n",
      "Place the chicken livers in the bowl of egg and milk mixture, and coat each liver. Place the livers, one at a time, into the plastic bag of flour mixture, and shake the bag to coat the each liver completely.\n",
      "Gently place the coated livers, a few at a time, into the hot oil. Cover the pan of oil with a frying screen to avoid getting burned by spatters of oil that will pop out as the livers fry. Deep fry the livers until crisp and golden brown, 5 to 6 minutes.\n"
    ],
    "calories": 470,
    "carb": 28,
    "protein": 24,
    "fat": 29
  },
  {
    "url": "https://www.allrecipes.com/recipe/220164/classic-cuban-style-picadillo/",
    "name": "Classic Cuban-Style Picadillo",
    "prep": "10 Mins",
    "cook": "20 Mins",
    "ready in": "30 Mins",
    "servings": "4 servings",
    "ingredients": [
      "1 tablespoon olive oil",
      "1 clove garlic, minced, or more to taste",
      "1 small onion, chopped",
      "½ green bell pepper, chopped",
      "1 pound lean ground beef",
      "6 large pitted green olives, quartered",
      "½ cup raisins",
      "1 tablespoon capers",
      "1 (8 ounce) can tomato sauce",
      "2 (1.41 ounce) packages sazon seasoning (such as Goya®)",
      "1 tablespoon ground cumin",
      "1 teaspoon white sugar",
      "salt to taste"
    ],
    "directions": [
      "Heat olive oil in a skillet over medium heat; cook and stir garlic, onion, and green bell pepper in the hot oil until softened, 5 to 7 minutes.\n",
      "Crumble ground beef into the skillet; cook and stir until browned completely, 7 to 10 minutes.\n",
      "Stir olives, raisins, capers, tomato sauce, sazon seasoning, cumin, sugar, and salt through the ground beef mixture.\n",
      "Cover the skillet, reduce heat to low, and cook until the mixture is heated through, 5 to 10 minutes.\n"
    ],
    "calories": 350,
    "carb": 24,
    "protein": 24,
    "fat": 19
  },
  {
    "url": "https://www.allrecipes.com/recipe/269500/creamy-garlic-pasta/",
    "name": "Creamy Garlic Pasta",
    "prep": "10 Mins",
    "cook": "20 Mins",
    "ready in": "30 Mins",
    "servings": "4 servings",
    "ingredients": [
      "2 teaspoons olive oil",
      "4 garlic cloves, minced",
      "2 tablespoons butter",
      "3 cups chicken broth, or more as needed",
      "½ teaspoon ground black pepper",
      "¼ teaspoon salt",
      "½ pound spaghetti",
      "1 cup grated Parmesan cheese",
      "¾ cup heavy cream",
      "1 ½ tablespoons dried parsley"
    ],
    "directions": [
      "Heat olive in a medium pan over medium heat. Add garlic and stir until fragrant, 1 to 2 minutes. Add butter and stir constantly until melted. Pour in chicken broth; add pepper and salt. Bring to a boil. Add spaghetti and cook, stirring occasionally, until tender yet firm to the bite, about 12 minutes. Add more chicken broth if pasta starts to stick to the pan.\n",
      "Stir Parmesan cheese, cream, and parsley into the pasta and mix thoroughly. Serve immediately.\n"
    ],
    "calories": 543,
    "carb": 47,
    "protein": 18,
    "fat": 32
  },
  {
    "url": "https://www.allrecipes.com/recipe/64557/grandmothers-pork-chop-dinner/",
    "name": "Grandmother's Pork Chop Dinner",
    "prep": "15 Mins",
    "cook": "40 Mins",
    "ready in": "55 Mins",
    "servings": "4 servings",
    "ingredients": [
      "¼ pound bacon",
      "4 pork chops",
      "1 onion, sliced",
      "3 potatoes, peeled and cut into thick slices",
      "1 cup water",
      "salt and pepper to taste"
    ],
    "directions": [
      "Place the bacon in a large, deep skillet with a lid, and cook over medium-high heat, turning occasionally, until cooked through but not crisp, about 6 minutes. Remove the bacon from the skillet and set aside to cool. Chop into small pieces.\n",
      "Sear the pork chops until browned on each side.\n",
      "Place the pork chops, bacon, onion, and potato slices into the skillet, and pour the water over the ingredients. Cover the skillet, bring to a boil over medium heat, reduce the heat, and simmer until the potatoes are tender, about 30 minutes. Sprinkle with salt and pepper, and serve.\n"
    ],
    "calories": 443,
    "carb": 34,
    "protein": 34,
    "fat": 19
  },
  {
    "url": "https://www.allrecipes.com/recipe/21736/pan-seared-salmon-i/",
    "name": "Pan Seared Salmon I",
    "prep": "10 Mins",
    "cook": "10 Mins",
    "ready in": "20 Mins",
    "servings": "4 servings",
    "ingredients": [
      "4 (6 ounce) fillets salmon",
      "2 tablespoons olive oil",
      "2 tablespoons capers",
      "⅛ teaspoon salt",
      "⅛ teaspoon ground black pepper",
      "4 slices  lemon"
    ],
    "directions": [
      "Preheat a large heavy skillet over medium heat for 3 minutes.\n",
      "Coat salmon with olive oil. Place in skillet, and increase heat to high. Cook for 3 minutes. Sprinkle with capers, and salt and pepper. Turn salmon over, and cook for 5 minutes, or until browned. Salmon is done when it flakes easily with a fork.\n",
      "Transfer salmon to individual plates, and garnish with lemon slices.\n"
    ],
    "calories": 371,
    "carb": 2,
    "protein": 34,
    "fat": 26
  },
  {
    "url": "https://www.allrecipes.com/recipe/166624/tomato-basil-salmon/",
    "name": "Tomato Basil Salmon",
    "prep": "10 Mins",
    "cook": "20 Mins",
    "ready in": "30 Mins",
    "servings": "2 salmon fillets",
    "ingredients": [
      "2 (6 ounce) boneless salmon fillets",
      "1 tablespoon dried basil",
      "1 tomato, thinly sliced",
      "1 tablespoon olive oil",
      "2 tablespoons grated Parmesan cheese"
    ],
    "directions": [
      "Preheat oven to 375  degrees F (190 degrees C). Line a baking sheet with a piece of aluminum foil, and spray with nonstick cooking spray. Place the salmon fillets onto the foil, sprinkle with basil, top with tomato slices, drizzle with olive oil, and sprinkle with the Parmesan cheese.\n",
      "Bake in the preheated oven until the salmon is opaque in the center, and the Parmesan cheese is lightly browned on top, about 20 minutes.\n"
    ],
    "calories": 406,
    "carb": 4,
    "protein": 37,
    "fat": 27
  },
  {
    "url": "https://www.allrecipes.com/recipe/285029/panko-crusted-air-fryer-mahi-mahi/",
    "name": "Panko-Crusted Air Fryer Mahi Mahi",
    "prep": "5 Mins",
    "cook": "15 Mins",
    "ready in": "20 Mins",
    "servings": "4 fillets",
    "ingredients": [
      "4 (4 ounce) mahi mahi fillets",
      "2 tablespoons grapeseed oil",
      "2 cups panko bread crumbs",
      "1 teaspoon everything bagel seasoning",
      "½ teaspoon garlic salt",
      "½ teaspoon ground turmeric",
      "½ teaspoon ground black pepper",
      "nonstick cooking spray",
      "1 teaspoon chopped fresh parsley",
      "1 medium lemon, cut into 4 wedges"
    ],
    "directions": [
      "Preheat an air fryer to 400 degrees F (200 degrees C) for 5 minutes.\n",
      "Meanwhile, place mahi mahi fillets on a platter and drizzle with grapeseed oil.\n",
      "Mix panko, bagel seasoning, garlic salt, turmeric, and pepper together in a shallow dish. Dip each fillet into the panko mixture to coat, then place in a single layer in the air fryer basket. Spray with nonstick spray.\n",
      "Cook in the preheated air fryer until fish flakes easily with a fork, 12 to 15 minutes, flipping halfway through.\n",
      "Remove from the air fryer. Garnish with parsley and lemon wedges. Serve immediately.\n"
    ],
    "calories": 305,
    "carb": 41,
    "protein": 27,
    "fat": 10
  },
  {
    "url": "https://www.allrecipes.com/recipe/235851/how-to-cook-trout/",
    "name": "How to Cook Trout",
    "prep": "15 Mins",
    "cook": "10 Mins",
    "ready in": "25 Mins",
    "servings": "2 servings",
    "ingredients": [
      "¼ cup butter",
      "2 (8 ounce) whole trout, butterflied and deboned",
      "salt and freshly ground black pepper to taste",
      "2 tablespoons freshly squeezed lemon juice",
      "2 tablespoons chopped fresh flat-leaf parsley"
    ],
    "directions": [
      "Melt butter in a saucepan over medium-low heat until butter smells toasted and is golden brown, about 1 minute. Turn off heat.\n",
      "Line a baking sheet with a piece of aluminum foil. Place trout onto foil; open trout so skin sides are down. Drizzle each trout with about 1/2 teaspoon melted butter. Generously season with salt and black pepper.\n",
      "Move an oven rack to 5 or 6 inches below heat source and preheat oven's broiler on high heat.\n",
      "Broil trout until opaque and barely firm to the touch, 2 or 3 minutes. Remove from oven.\n",
      "Return pan of melted butter over high heat; stir in lemon juice and parsley. Bring butter sauce to a boil; whisk to combine. Serve trout on plates and drizzle with butter sauce.\n"
    ],
    "calories": 471,
    "carb": 2,
    "protein": 41,
    "fat": 34
  },
  {
    "url": "https://www.allrecipes.com/recipe/16700/salsa-chicken/",
    "name": "Salsa Chicken",
    "prep": "5 Mins",
    "cook": "40 Mins",
    "ready in": "45 Mins",
    "servings": "4 servings",
    "ingredients": [
      "4 skinless, boneless chicken breast halves",
      "4 teaspoons taco seasoning mix",
      "1 cup salsa",
      "1 cup shredded Cheddar cheese",
      "2 tablespoons sour cream"
    ],
    "directions": [
      "Preheat oven to 375  degrees F (190 degrees C)\n",
      "Place chicken breasts in a lightly greased 9x13 inch baking dish. Sprinkle taco seasoning on both sides of chicken breasts, and pour salsa over all.\n",
      "Bake at 375 degrees F (190 degrees C) for 25 to 35 minutes, or until chicken is tender and juicy and its juices run clear.\n",
      "Sprinkle chicken evenly with cheese, and continue baking for an additional 3 to 5 minutes, or until cheese is melted and bubbly. Top with sour cream if desired, and serve.\n"
    ],
    "calories": 287,
    "carb": 7,
    "protein": 36,
    "fat": 13
  },
  {
    "url": "https://www.allrecipes.com/recipe/25874/shrimp-scampi-bake/",
    "name": "Shrimp Scampi Bake",
    "prep": "30 Mins",
    "cook": "15 Mins",
    "ready in": "45 Mins",
    "servings": "6 servings",
    "ingredients": [
      "1 cup butter",
      "2 tablespoons prepared Dijon-style mustard",
      "1 tablespoon fresh lemon juice",
      "1 tablespoon chopped garlic",
      "1 tablespoon chopped fresh parsley",
      "2 pounds medium raw shrimp, shelled, deveined, with tails attached"
    ],
    "directions": [
      "Preheat oven to 450 degrees F (230 degrees C).\n",
      "In a small saucepan over medium heat, combine the butter, mustard, lemon juice, garlic, and parsley. When the butter melts completely, remove from heat.\n",
      "Arrange shrimp in a shallow baking dish. Pour the butter mixture over the shrimp.\n",
      "Bake in preheated oven for 12 to 15 minutes or until the shrimp are pink and opaque.\n"
    ],
    "calories": 421,
    "carb": 2,
    "protein": 30,
    "fat": 33
  },
  {
    "url": "https://www.allrecipes.com/recipe/212451/enchanted-sour-cream-chicken-enchiladas/",
    "name": "Enchanted Sour Cream Chicken Enchiladas",
    "prep": "15 Mins",
    "cook": "15 Mins",
    "ready in": "30 Mins",
    "servings": "1 9x13-inch baking dish",
    "ingredients": [
      "2 cups cubed cooked chicken",
      "1 cup sour cream",
      "⅛ teaspoon salt",
      "1 pinch ground black pepper",
      "½ cup vegetable oil for frying",
      "12 (5 inch) corn tortillas",
      "1 (4 ounce) can chopped green chilies, drained",
      "2 cups shredded Monterey Jack cheese"
    ],
    "directions": [
      "Preheat an oven to 400 degrees F (200 degrees C). Grease a 9x13 inch baking dish. Combine the chicken, sour cream, salt, and pepper in a bowl; set aside.\n",
      "Heat the oil in a skillet over medium-high heat. Dip the corn tortillas into the hot oil one at a time until softened, about 10 seconds each. Spoon a heaping tablespoon of chicken mixture onto each tortilla, spread down the center and roll into a cylinder. Place seam side down into the prepared baking dish. When all tortillas are filled and rolled, sprinkle the green chiles over all and top with the shredded Monterey Jack cheese.\n",
      "Bake in the preheated oven until the cheese has melted and the enchiladas are hot, 12 to 15 minutes.\n"
    ],
    "calories": 434,
    "carb": 25,
    "protein": 27,
    "fat": 27
  },
  {
    "url": "https://www.allrecipes.com/recipe/222509/easy-and-quick-halushki/",
    "name": "Easy and Quick Halushki",
    "prep": "10 Mins",
    "cook": "20 Mins",
    "ready in": "30 Mins",
    "servings": "6 servings",
    "ingredients": [
      "1 pound bacon",
      "1 onion, diced",
      "1 (16 ounce) package egg noodles",
      "1 head cabbage, sliced",
      "salt and ground black pepper to taste"
    ],
    "directions": [
      "Snip bacon into small pieces with a scissors and cook in a large skillet over medium heat until crisp, stirring often, about 10 minutes. Cook and stir onion with bacon until translucent, about 5 more minutes; set bacon and onion aside, leaving drippings in the skillet.\n",
      "Bring a large pot of lightly salted water to a boil. Cook egg noodles in the boiling water, stirring occasionally until cooked through but firm to the bite, about 5 minutes. Drain.\n",
      "Transfer bacon and onion mixture with drippings into the pot used to cook the noodles and cook and stir cabbage until coated with drippings. Cover pot and cook until cabbage is tender, 10 to 12 minutes, stirring occasionally. Gently stir in noodles and season to taste with salt and black pepper.\n"
    ],
    "calories": 698,
    "carb": 69,
    "protein": 23,
    "fat": 38
  },
  {
    "url": "https://www.allrecipes.com/recipe/273414/baked-pesto-chicken-tenders/",
    "name": "Baked Pesto Chicken Tenders",
    "prep": "5 Mins",
    "cook": "30 Mins",
    "ready in": "35 Mins",
    "servings": "4 servings",
    "ingredients": [
      "3 tablespoons pesto",
      "1 tablespoon mayonnaise",
      "1 pound chicken breast tenderloins",
      "1 cup panko bread crumbs"
    ],
    "directions": [
      "Preheat the oven to 400 degrees F (200 degrees C).\n",
      "Whisk pesto and mayonnaise together in a bowl. Dredge both sides of each chicken tender in the pesto mixture and coat with bread crumbs. Arrange tenders on a baking sheet.\n",
      "Bake in the preheated oven for 15 minutes. Turn chicken pieces and continue baking until chicken is no longer pink in the center and the juices run clear, about 15 more minutes. An instant-read thermometer inserted into the centers should read at least 165 degrees F (74 degrees C).\n"
    ],
    "calories": 294,
    "carb": 20,
    "protein": 31,
    "fat": 13
  },
  {
    "url": "https://www.allrecipes.com/recipe/24681/oven-fried-pork-chops/",
    "name": "Oven-Fried Pork Chops",
    "prep": "10 Mins",
    "cook": "20 Mins",
    "ready in": "30 Mins",
    "servings": "4 servings",
    "ingredients": [
      "4 pork chops, trimmed",
      "2 tablespoons butter, melted",
      "1 egg, beaten",
      "2 tablespoons milk",
      "¼ teaspoon black pepper",
      "1 cup herb-seasoned dry bread stuffing mix"
    ],
    "directions": [
      "Preheat oven to 425 degrees F (220 degrees C). Pour butter into a 9x13 inch baking pan.\n",
      "Stir together egg, milk and pepper. Dip pork chops in egg mixture, coat with stuffing mix and place in pan.\n",
      "Bake in preheated oven for 10 minutes. Turn chops and bake for another 10 minutes, or until no pink remains in the meat and juices run clear.\n"
    ],
    "calories": 423,
    "carb": 39,
    "protein": 33,
    "fat": 15
  },
  {
    "url": "https://www.allrecipes.com/recipe/234415/luckys-quickie-chickie/",
    "name": "Lucky's Quickie Chickie",
    "prep": "10 Mins",
    "cook": "10 Mins",
    "ready in": "20 Mins",
    "servings": "2 servings",
    "ingredients": [
      "2 teaspoons olive oil",
      "6 ounces chicken tenderloin strips",
      "¼ teaspoon salt",
      "⅛ teaspoon freshly ground black pepper",
      "2 tablespoons chopped fresh basil",
      "1 ½ teaspoons honey",
      "1 ½ teaspoons balsamic vinegar, or more to taste"
    ],
    "directions": [
      "Heat olive oil in a nonstick skillet over medium-high heat. Season chicken with salt and pepper. Cook and stir chicken in the hot oil until chicken is no longer pink in the center, about 3 to 5 minutes. Stir basil, honey, and balsamic vinegar into chicken and cook for 1 more minute.\n"
    ],
    "calories": 157,
    "carb": 6,
    "protein": 18,
    "fat": 7
  },
  {
    "url": "https://www.allrecipes.com/recipe/228043/whole-grilled-trout/",
    "name": "Whole Grilled Trout",
    "prep": "15 Mins",
    "cook": "15 Mins",
    "ready in": "30 Mins",
    "servings": "2 whole trout",
    "ingredients": [
      "2 whole trout, cleaned",
      "1 tablespoon olive oil, divided",
      "1 pinch coarse sea salt to taste",
      "1 pinch ground black pepper",
      "½ lemon, thinly sliced",
      "½ sweet onion, thinly sliced",
      "1 clove garlic, minced",
      "2 sprigs fresh rosemary",
      "2 sprigs fresh thyme"
    ],
    "directions": [
      "Preheat an outdoor grill for high heat and lightly oil the grate.\n",
      "Rub each trout generously with olive oil and sprinkle with sea salt; sprinkle inside of cavities with salt and black pepper. Place half the lemon and onion slices into cavity of each trout, along with minced garlic, and place a sprig of rosemary and thyme into cavities.\n",
      "Turn preheated grill down to low and place the trout directly onto the grill; cook until flesh flakes easily and the skins are browned, 6 to 7 minutes per side, flipping once.\n"
    ],
    "calories": 243,
    "carb": 4,
    "protein": 31,
    "fat": 12
  },
  {
    "url": "https://www.allrecipes.com/recipe/230818/pork-fried-rice/",
    "name": "Pork Fried Rice",
    "prep": "15 Mins",
    "cook": "15 Mins",
    "ready in": "30 Mins",
    "servings": "2 servings",
    "ingredients": [
      "1 tablespoon butter",
      "1 (6 ounce) boneless pork loin chop, cut into small pieces",
      "¼ cup chopped carrot",
      "¼ cup chopped broccoli",
      "1 green onion, chopped",
      "1 egg, beaten",
      "1 cup cold cooked rice",
      "¼ cup frozen peas",
      "1 ½ tablespoons soy sauce",
      "⅛ teaspoon garlic powder",
      "⅛ teaspoon ground ginger"
    ],
    "directions": [
      "Melt butter in a large non-stick skillet over medium heat. Cook and stir pork, carrot, broccoli, peas, and green onion in melted butter until pork is cooked through, 7 to 10 minutes. Remove pork mixture to a bowl and return skillet to medium heat.\n",
      "Scramble egg in the skillet until completely set. Return the pork mixture to the skillet. Stir rice, peas, soy sauce, garlic powder, and ground ginger into the pork mixture; cook and stir until heated through, 7 to 10 minutes.\n"
    ],
    "calories": 557,
    "carb": 81,
    "protein": 27,
    "fat": 14
  },
  {
    "url": "https://www.allrecipes.com/recipe/190015/slow-cooker-moscow-chicken/",
    "name": "Slow Cooker Moscow Chicken",
    "prep": "10 Mins",
    "cook": "5 Hours 0 Mins",
    "ready in": "5 Hours 10 Mins",
    "servings": "6 servings",
    "ingredients": [
      "6 chicken thighs",
      "6 slices bacon",
      "2 cloves garlic, roughly chopped",
      "2 green onions, chopped",
      "½ teaspoon grated ginger root",
      "1 (10 fluid ounce) bottle Russian-style salad dressing",
      "salt and pepper to taste"
    ],
    "directions": [
      "Heat a large skillet over medium-high heat. Cook chicken until well browned on both sides. Allow chicken to cool slightly.\n",
      "Wrap each thigh in a piece of bacon, and place in slow cooker. Sprinkle garlic and ginger over the chicken; top with Russian dressing. Cook on Low heat for 5 to 6 hours. Season to taste with salt and pepper.\n"
    ],
    "calories": 446,
    "carb": 16,
    "protein": 24,
    "fat": 33
  },
  {
    "url": "https://www.allrecipes.com/recipe/241372/easy-baked-bbq-pork-chops/",
    "name": "Easy Baked BBQ Pork Chops",
    "prep": "15 Mins",
    "cook": "30 Mins",
    "ready in": "45 Mins",
    "servings": "6 servings",
    "ingredients": [
      "1 onion, finely chopped",
      "1 cup ketchup",
      "2 tablespoons white wine vinegar",
      "2 tablespoons honey",
      "2 tablespoons brown sugar",
      "1 tablespoon Worcestershire sauce",
      "1 tablespoon yellow mustard",
      "1 teaspoon cayenne pepper",
      "6 thin pork chops",
      "salt and ground black pepper to taste"
    ],
    "directions": [
      "Preheat oven to 440 degrees F (227 degrees C).\n",
      "Whisk onion, ketchup, vinegar, honey, brown sugar, Worcestershire sauce, mustard, and cayenne pepper together in a bowl until barbeque sauce is smooth.\n",
      "Place pork chops on a baking sheet and season with salt and pepper. Top each pork chop with 2 tablespoons barbeque sauce.\n",
      "Bake in the preheated oven until pork chops are cooked through, about 30 minutes. An instant-read thermometer inserted into the center should read at least 145 degrees F (63 degrees C).\n"
    ],
    "calories": 190,
    "carb": 23,
    "protein": 16,
    "fat": 5
  },
  {
    "url": "https://www.allrecipes.com/recipe/229324/ground-beef-and-cabbage/",
    "name": "Ground Beef and Cabbage",
    "prep": "15 Mins",
    "cook": "45 Mins",
    "ready in": "60 Mins",
    "servings": "6 servings",
    "ingredients": [
      "1 large head cabbage, finely chopped",
      "1 (14.5 ounce) can diced tomatoes with juice",
      "1 onion, halved and thinly sliced",
      "1 tablespoon Italian seasoning",
      "salt and ground black pepper to taste",
      "1 pound lean ground beef"
    ],
    "directions": [
      "Combine cabbage, tomatoes with juice, onion, Italian seasoning, salt, and black pepper in a large pot over low  heat. Bring cabbage mixture to a simmer and crumble ground beef into the pot. Cover and cook until cabbage is tender and ground beef is cooked through, about 45 minutes. Stir occasionally.\n"
    ],
    "calories": 228,
    "carb": 19,
    "protein": 19,
    "fat": 10
  },
  {
    "url": "https://www.allrecipes.com/recipe/195045/the-best-spaghetti-casserole/",
    "name": "The Best Spaghetti Casserole",
    "prep": "15 Mins",
    "cook": "55 Mins",
    "ready in": "70 Mins",
    "servings": "12 servings",
    "ingredients": [
      "1 (16 ounce) package spaghetti",
      "2 pounds ground beef",
      "¼ cup chopped onion",
      "2 (26.5 ounce) cans meatless spaghetti sauce",
      "1 (16 ounce) container fat-free sour cream",
      "2 cups shredded mozzarella cheese, divided",
      "½ cup Parmesan cheese",
      "salt and black pepper to taste"
    ],
    "directions": [
      "Preheat oven to 350 degrees F (175 degrees C). Grease a deep 9x13 inch baking dish.\n",
      "Bring a large pot of salted water to a boil over high heat. Stir in the spaghetti. Boil the pasta until cooked through but still firm to the bite, 8 to 10 minutes. Drain well.\n",
      "Brown ground beef and onion in a large skillet over high heat; drain fat. Stir in the spaghetti sauce, sour cream, and 1 cup of the mozzarella. Mix in the cooked pasta. Transfer pasta mixture to prepared baking dish. Top with remaining 1 cup of mozzarella and the Parmesan cheese. Cover pan with aluminum foil.\n",
      "Bake in preheated oven until hot and bubbly, about 30 minutes.\n"
    ],
    "calories": 482,
    "carb": 52,
    "protein": 29,
    "fat": 17
  },
  {
    "url": "https://www.allrecipes.com/recipe/34419/easy-red-beans-and-rice/",
    "name": "Easy Red Beans and Rice",
    "prep": "10 Mins",
    "cook": "30 Mins",
    "ready in": "40 Mins",
    "servings": "8 servings",
    "ingredients": [
      "2 cups water",
      "1 cup uncooked rice",
      "1 (16 ounce) package turkey kielbasa, cut diagonally into 1/4 inch slices",
      "1 onion, chopped",
      "1 green bell pepper, chopped",
      "1 clove chopped garlic",
      "2 (15 ounce) cans canned kidney beans, drained",
      "1 (16 ounce) can whole peeled tomatoes, chopped",
      "½ teaspoon dried oregano",
      "salt to taste",
      "½ teaspoon pepper"
    ],
    "directions": [
      "In a saucepan, bring water to a boil. Add rice and stir. Reduce heat, cover and simmer for 20 minutes.\n",
      "In a large skillet over low heat, cook sausage for 5 minutes. Stir in onion, green pepper and garlic; saute until tender. Pour in beans and tomatoes with juice. Season with oregano, salt and pepper. Simmer uncovered for 20 minutes. Serve over rice.\n"
    ],
    "calories": 290,
    "carb": 43,
    "protein": 17,
    "fat": 6
  },
  {
    "url": "https://www.allrecipes.com/recipe/228056/parmesan-crusted-tilapia-fillets/",
    "name": "Parmesan Crusted Tilapia Fillets",
    "prep": "10 Mins",
    "cook": "10 Mins",
    "ready in": "20 Mins",
    "servings": "4 servings",
    "ingredients": [
      "¾ cup grated Parmesan cheese",
      "2 teaspoons paprika",
      "1 tablespoon chopped fresh parsley",
      "salt and ground black pepper to taste",
      "4 tilapia fillets",
      "olive oil"
    ],
    "directions": [
      "Preheat oven to 400 degrees F (200 degrees C). Line a baking sheet with aluminum foil.\n",
      "Whisk Parmesan cheese, paprika, parsley, salt, and pepper together in a shallow dish.\n",
      "Coat tilapia fillets with olive oil and press into the Parmesan cheese mixture. Arrange coated fillets on the prepared baking sheet.\n",
      "Bake in preheated oven until the fish flakes easily with a fork, 10 to 12 minutes.\n"
    ],
    "calories": 210,
    "carb": 2,
    "protein": 29,
    "fat": 10
  },
  {
    "url": "https://www.allrecipes.com/recipe/17303/taco-pie/",
    "name": "Taco Pie",
    "prep": "20 Mins",
    "cook": "10 Mins",
    "ready in": "30 Mins",
    "servings": "4 servings",
    "ingredients": [
      "1 (8 ounce) package refrigerated crescent rolls",
      "1 pound ground beef",
      "1 (1 ounce) package taco seasoning mix",
      "1 (16 ounce) container sour cream",
      "8 ounces shredded Mexican-style cheese blend",
      "1 (14 ounce) bag tortilla chips, crushed"
    ],
    "directions": [
      "Preheat oven to 350 degrees F (175 degrees C).\n",
      "Lay crescent dough flat on the bottom of a square cake pan and bake according to package directions.\n",
      "Meanwhile, brown the ground beef in a large skillet over medium high heat. Add the taco seasoning and stir together well. When dough is done, remove from oven and place meat mixture on top, then layer with sour cream and cheese, and then top off with the crushed nacho chips.\n",
      "Return to oven and bake at 350 degrees F (175 degrees C) for 10 minutes, or until cheese has melted.\n"
    ],
    "calories": 688,
    "carb": 51,
    "protein": 25,
    "fat": 44
  },
  {
    "url": "https://www.allrecipes.com/recipe/25911/mamas-best-broiled-tomato-sandwich/",
    "name": "Mama's Best Broiled Tomato Sandwich",
    "prep": "10 Mins",
    "cook": "5 Mins",
    "ready in": "15 Mins",
    "servings": "2 servings",
    "ingredients": [
      "2 tablespoons olive oil",
      "2 tablespoons balsamic vinegar",
      "4 ripe tomatoes, sliced",
      "3 tablespoons mayonnaise",
      "½ teaspoon dried parsley",
      "¼ teaspoon dried oregano",
      "¼ teaspoon black pepper",
      "3 tablespoons grated Parmesan cheese, divided",
      "4 slices bread, lightly toasted"
    ],
    "directions": [
      "Preheat oven to broil.\n",
      "In a shallow bowl, whisk together the olive oil and vinegar.  Marinate the tomatoes in the mixture, stirring occasionally.\n",
      "Meanwhile, in a small bowl, combine mayonnaise, parsley, oregano, black pepper and 4 teaspoons Parmesan cheese.  Spread mixture on each slice of toasted bread.  Place marinated tomatoes on 2 slices and sprinkle with remaining Parmesan cheese.\n",
      "Place on a baking sheet and broil for 5 minutes, or until cheese turns golden brown.  Serve immediately, open faced or closed.\n"
    ],
    "calories": 510,
    "carb": 44,
    "protein": 10,
    "fat": 35
  },
  {
    "url": "https://www.allrecipes.com/recipe/272437/keto-smothered-chicken-thighs/",
    "name": "Keto Smothered Chicken Thighs",
    "prep": "10 Mins",
    "cook": "50 Mins",
    "ready in": "60 Mins",
    "servings": "4 servings",
    "ingredients": [
      "4 (8 ounce) skin-on, bone-in chicken thighs",
      "1 teaspoon paprika",
      "salt and pepper to taste",
      "4 slices bacon, cut into 1/2 inch pieces",
      "⅓ cup low-sodium chicken broth",
      "4 ounces sliced mushrooms",
      "¼ cup heavy whipping cream",
      "2 green onions, white and green parts separated and sliced"
    ],
    "directions": [
      "Preheat the oven to 400 degrees F (200 degrees C).\n",
      "Season chicken thighs on all sides with paprika, salt, and pepper.\n",
      "Cook bacon in a cast iron skillet or oven-safe pan over medium-high heat until browned, 4 to 5 minutes. Remove from skillet and drain on a paper towel-lined plate. Drain and discard excess grease from skillet.\n",
      "Return skillet to medium heat and cook chicken thighs, skin-side down, for 3 to 4 minutes. Flip chicken over and place skillet in the preheated oven.\n",
      "Bake until chicken thighs are no longer pink at the bone and juices run clear, about 30 minutes. An instant-read thermometer inserted near the bone should read 165 degrees F (74 degrees C). Remove chicken to a plate and cover with foil to keep warm. Remove all but 2 tablespoons drippings from skillet.\n",
      "Return skillet to the stove over medium-high heat. Pour in chicken broth while whisking up brown bits from the bottom of the skillet. Add mushrooms and cook until soft, about 3 to 4 minutes. Pour in heavy whipping cream and whisk together until lightly simmering, then reduce heat to medium-low. Season with salt and pepper, if necessary.\n",
      "Return chicken and any juices back into skillet; top with bacon and green onions. Serve immediately, spooning sauce over the chicken.\n"
    ],
    "calories": 467,
    "carb": 3,
    "protein": 41,
    "fat": 32
  },
  {
    "url": "https://www.allrecipes.com/recipe/222405/polish-noodles-cottage-cheese-and-noodles/",
    "name": "Polish Noodles (Cottage Cheese and Noodles)",
    "prep": "10 Mins",
    "cook": "20 Mins",
    "ready in": "30 Mins",
    "servings": "6 servings",
    "ingredients": [
      "½ cup butter",
      "1 small onion, diced",
      "1 (16 ounce) package egg noodles",
      "1 (16 ounce) package cottage cheese",
      "½ cup sour cream",
      "½ teaspoon sea salt",
      "¼ teaspoon ground black pepper"
    ],
    "directions": [
      "Melt butter in a saucepan over medium heat. Cook and stir onion in melted butter until softened, 7 to 10 minutes.\n",
      "Bring a large pot of lightly salted water to a boil. Cook egg noodles in the boiling water, stirring occasionally until cooked through but firm to the bite, about 5 minutes. Drain and return to the pot.\n",
      "Stir butter and onion mixture, cottage cheese, sour cream, sea salt, and black pepper into the noodles. Place the pot over medium heat; cook and stir until heated through and warm, 5 to 8 minutes.\n"
    ],
    "calories": 546,
    "carb": 58,
    "protein": 21,
    "fat": 27
  },
  {
    "url": "https://www.allrecipes.com/recipe/219431/parmesan-crusted-chicken/",
    "name": "Parmesan Crusted Chicken",
    "prep": "10 Mins",
    "cook": "20 Mins",
    "ready in": "30 Mins",
    "servings": "4 servings",
    "ingredients": [
      "½ cup Hellmann's® or Best Foods® Real Mayonnaise",
      "¼ cup grated Parmesan cheese",
      "4 (5 ounce) boneless, skinless chicken breast halves",
      "4 teaspoons Italian seasoned dry bread crumbs"
    ],
    "directions": [
      "Preheat oven to 425 degrees F.\n",
      "Combine Hellmann's&reg; or Best Foods&reg; Real Mayonnaise with cheese in medium bowl.\n",
      "Arrange chicken on baking sheet. Evenly top with mayonnaise mixture, then sprinkle with bread crumbs.\n",
      "Bake 20 minutes or until chicken is thoroughly cooked.\n"
    ],
    "calories": 400,
    "carb": 2,
    "protein": 32,
    "fat": 29
  },
  {
    "url": "https://www.allrecipes.com/recipe/281362/oven-fried-chicken-thighs/",
    "name": "Oven-\"Fried\" Chicken Thighs",
    "prep": "10 Mins",
    "cook": "40 Mins",
    "ready in": "50 Mins",
    "servings": "6 servings",
    "ingredients": [
      "6 chicken thighs",
      "2 cups all-purpose flour",
      "2 pinches cayenne pepper, divided, or to taste",
      "2 pinches garlic powder, divided, or to taste",
      "1 pinch salt and ground black pepper to taste",
      "3 large eggs",
      "2 cups panko bread crumbs"
    ],
    "directions": [
      "Preheat the oven to 400 degrees F (200 degrees C). Line a baking pan with parchment paper.\n",
      "Combine flour, 1 pinch cayenne, 1 pinch garlic powder, salt, and pepper in a shallow bowl.\n",
      "Whisk eggs in a second bowl.\n",
      "Combine panko bread crumbs with 1 pinch cayenne, 1 pinch garlic powder, salt, and pepper in another shallow bowl.\n",
      "Dip chicken thighs into the flour mixture, followed by beaten eggs, and then into the panko mixture. Transfer to the prepared pan.\n",
      "Bake in the preheated oven until coating is golden and chicken thighs are no longer pink in the centers, about 40 minutes. An instant-read thermometer inserted near the bone should read 165 degrees F (74 degrees C).\n"
    ],
    "calories": 455,
    "carb": 63,
    "protein": 25,
    "fat": 15
  },
  {
    "url": "https://www.allrecipes.com/recipe/256349/baked-fish-fillets/",
    "name": "Baked Fish Fillets",
    "prep": "10 Mins",
    "cook": "20 Mins",
    "ready in": "30 Mins",
    "servings": "6 servings",
    "ingredients": [
      "1 tablespoon vegetable oil, or to taste",
      "2 pounds mackerel fillets",
      "1 teaspoon salt",
      "⅛ teaspoon ground black pepper",
      "¼ cup butter, melted",
      "2 tablespoons lemon juice",
      "⅛ teaspoon ground paprika"
    ],
    "directions": [
      "Preheat oven to 350 degrees F (175 degrees C). Grease a baking pan with vegetable oil.\n",
      "Place mackerel fillets in the baking pan; season with salt and pepper.\n",
      "Mix butter, lemon juice, and paprika together in a bowl. Pour over mackerel fillets.\n",
      "Bake in the preheated oven until mackerel flakes easily with a fork, 20 to 25 minutes.\n"
    ],
    "calories": 399,
    "carb": 1,
    "protein": 29,
    "fat": 31
  },
  {
    "url": "https://www.allrecipes.com/recipe/26714/bologna-salad-sandwich-spread-ii/",
    "name": "Bologna Salad Sandwich Spread II",
    "prep": "20 Mins",
    "cook": "n/a",
    "ready in": "20 Mins",
    "servings": "3 cups",
    "ingredients": [
      "4 eggs",
      "1 ½ pounds unsliced bologna",
      "6 medium sweet pickles",
      "¼ cup mayonnaise"
    ],
    "directions": [
      "Place eggs in a medium saucepan and cover with cold water. Bring water to a boil and immediately remove from heat. Cover and let eggs stand in hot water for 10 to 12 minutes. Remove from water, cool and peel.\n",
      "In a food processor, place eggs, bologna and sweet pickles. Blend to a spreadable consistency.\n",
      "Transfer mixture to a medium bowl. Mix in mayonnaise, increasing the amount as necessary to make the mixture smooth. Cover and chill in the refrigerator until serving.\n"
    ],
    "calories": 123,
    "carb": 2,
    "protein": 5,
    "fat": 11
  },
  {
    "url": "https://www.allrecipes.com/recipe/262506/panko-parmesan-salmon/",
    "name": "Panko Parmesan Salmon",
    "prep": "5 Mins",
    "cook": "15 Mins",
    "ready in": "20 Mins",
    "servings": "4 salmon fillets",
    "ingredients": [
      "4 (4 ounce) salmon fillets",
      "1 ½ tablespoons fresh lemon juice",
      "salt and ground black pepper to taste",
      "½ cup panko bread crumbs",
      "¼ cup grated Parmesan cheese",
      "1 tablespoon extra-virgin olive oil",
      "1 teaspoon Italian seasoning",
      "⅛ teaspoon garlic powder"
    ],
    "directions": [
      "Preheat the oven to 425 degrees F (220 degrees C). Lightly grease a 9x13-inch baking pan.\n",
      "Place salmon fillets into the baking pan and sprinkle evenly with lemon juice. Season with salt and pepper.\n",
      "Combine panko, Parmesan cheese, olive oil, Italian seasoning, and garlic powder in a bowl. Sprinkle mixture evenly over the salmon.\n",
      "Bake in the preheated oven until topping is lightly browned and salmon flakes easily with a fork, 15 to 20 minutes.\n"
    ],
    "calories": 212,
    "carb": 11,
    "protein": 25,
    "fat": 10
  },
  {
    "url": "https://www.allrecipes.com/recipe/9011/simple-lemon-herb-chicken/",
    "name": "Simple Lemon Herb Chicken",
    "prep": "10 Mins",
    "cook": "15 Mins",
    "ready in": "25 Mins",
    "servings": "2 servings",
    "ingredients": [
      "2 skinless, boneless chicken breast halves",
      "1 lemon",
      "salt and pepper to taste",
      "1 tablespoon olive oil",
      "1 pinch dried oregano",
      "2 sprigs fresh parsley, for garnish"
    ],
    "directions": [
      "Cut lemon in half, and squeeze juice from 1/2 lemon on chicken. Season with salt to taste. Let sit while you heat oil in a small skillet over medium low heat.\n",
      "When oil is hot, put chicken in skillet. As you saute chicken, add juice from other 1/2 lemon, pepper to taste, and oregano. Saute for 5 to 10 minutes each side, or until juices run clear. Serve with parsley for garnish.\n"
    ],
    "calories": 212,
    "carb": 8,
    "protein": 29,
    "fat": 9
  },
  {
    "url": "https://www.allrecipes.com/recipe/87279/salmon-with-lemon-and-dill/",
    "name": "Salmon with Lemon and Dill",
    "prep": "10 Mins",
    "cook": "25 Mins",
    "ready in": "35 Mins",
    "servings": "4 servings",
    "ingredients": [
      "1 pound salmon fillets",
      "¼ cup butter, melted",
      "5 tablespoons lemon juice",
      "1 tablespoon dried dill weed",
      "¼ teaspoon garlic powder",
      "sea salt to taste",
      "freshly ground black pepper to taste"
    ],
    "directions": [
      "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a medium baking dish.\n",
      "Place salmon in the baking dish. Mix the butter and lemon juice in a small bowl, and drizzle over the salmon. Season with dill, garlic powder, sea salt, and pepper.\n",
      "Bake 25 minutes in the preheated oven, or until salmon is easily flaked with a fork.\n"
    ],
    "calories": 321,
    "carb": 3,
    "protein": 26,
    "fat": 23
  },
  {
    "url": "https://www.allrecipes.com/recipe/172704/chinese-pepper-steak/",
    "name": "Chinese Pepper Steak",
    "prep": "15 Mins",
    "cook": "15 Mins",
    "ready in": "30 Mins",
    "servings": "4 servings",
    "ingredients": [
      "1 pound beef top sirloin steak",
      "¼ cup soy sauce",
      "2 tablespoons white sugar",
      "2 tablespoons cornstarch",
      "½ teaspoon ground ginger",
      "3 tablespoons vegetable oil, divided",
      "1 red onion, cut into 1-inch squares",
      "1 green bell pepper, cut into 1-inch squares",
      "2 tomatoes, cut into wedges"
    ],
    "directions": [
      "Slice the steak into 1/2-inch thick slices across the grain.\n",
      "Whisk together soy sauce, sugar, cornstarch, and ginger in a bowl until the sugar has dissolved and the mixture is smooth. Place the steak slices into the marinade, and stir until well-coated.\n",
      "Heat 1 tablespoon of vegetable oil in a wok or large skillet over medium-high heat, and place 1/3 of the steak strips into the hot oil. Cook and stir until the beef is well-browned, about 3 minutes, and remove the beef from the wok to a bowl. Repeat twice more, with the remaining beef, and set the cooked beef aside.\n",
      "Return all the cooked beef to the hot wok, and stir in the onion. Toss the beef and onion together until the onion begins to soften, about 2 minutes, then stir in the green pepper. Cook and stir the mixture until the pepper has turned bright green and started to become tender, about 2 minutes, then add the tomatoes, stir everything together, and serve.\n"
    ],
    "calories": 312,
    "carb": 17,
    "protein": 27,
    "fat": 16
  },
  {
    "url": "https://www.allrecipes.com/recipe/275576/easy-air-fryer-pork-chops/",
    "name": "Easy Air Fryer Pork Chops",
    "prep": "10 Mins",
    "cook": "20 Mins",
    "ready in": "35 Mins",
    "servings": "4 servings",
    "ingredients": [
      "½ cup grated Parmesan cheese",
      "1 teaspoon paprika",
      "1 teaspoon garlic powder",
      "1 teaspoon kosher salt",
      "1 teaspoon dried parsley",
      "½ teaspoon ground black pepper",
      "4 (5 ounce) center-cut pork chops",
      "2 tablespoons extra virgin olive oil"
    ],
    "directions": [
      "Preheat the air fryer to 380 degrees F (190 degrees C).\n",
      "Combine Parmesan cheese, paprika, garlic powder, salt, parsley, and pepper in a flat shallow dish; mix well.\n",
      "Coat each pork chop with olive oil. Dredge both sides of each chop in the Parmesan mixture and set on a plate.\n",
      "Place 2 chops in the basket of the air fryer and cook for 10 minutes; flipping halfway through cook time.\n",
      "Transfer to a cutting board and let rest for 5 minutes. Repeat with remaining chops.\n"
    ],
    "calories": 305,
    "carb": 2,
    "protein": 36,
    "fat": 17
  },
  {
    "url": "https://www.allrecipes.com/recipe/245367/pan-roasted-chicken-breasts/",
    "name": "Pan-Roasted Chicken Breasts",
    "prep": "5 Mins",
    "cook": "12 Mins",
    "ready in": "17 Mins",
    "servings": "4 servings",
    "ingredients": [
      "4 boneless chicken breast halves with skin",
      "salt and freshly ground black pepper to taste",
      "1 tablespoon chopped fresh herbs (thyme, parsley, rosemary)",
      "2 tablespoons olive oil",
      "¼ cup apple cider vinegar",
      "4 tablespoons cold butter, cut into small pieces",
      "1 tablespoon chicken broth (or water), if needed to thin sauce"
    ],
    "directions": [
      "Season chicken on both sides with salt and pepper.\n",
      "Heat olive oil in a heavy skillet over medium-high heat until it starts to shimmer. Place chicken breasts in skillet skin side down. Sprinkle with fresh herbs. Do not disturb the breasts until the skin side sears, 5 or 6 minutes. Turn chicken.\n",
      "Cook until internal temperature reaches 150 degrees F, about 5 minutes. Add vinegar and butter to pan with chicken. Shake pan gently until butter melts and internal temperature of chicken reaches 160 to 165 degrees F, 2 to 3 minutes more. Add a splash of chicken broth or water if sauce needs to be thinned.\n"
    ],
    "calories": 463,
    "carb": 1,
    "protein": 46,
    "fat": 30
  },
  {
    "url": "https://www.allrecipes.com/recipe/75115/grilled-swordfish/",
    "name": "Grilled Swordfish",
    "prep": "10 Mins",
    "cook": "12 Mins",
    "ready in": "32 Mins",
    "servings": "4 Servings",
    "ingredients": [
      "4 (8 ounce) swordfish steaks",
      "½ cup teriyaki sauce",
      "2 tablespoons margarine, softened",
      "1 teaspoon garlic powder"
    ],
    "directions": [
      "Preheat outdoor grill for medium heat.\n",
      "Marinate swordfish in teriyaki sauce for 5 minutes per side.\n",
      "Lightly oil grill grate. Grill steaks, basting frequently with melted margarine, for 5 to 6 minutes per side, or until fish flakes easily with a fork. Season with garlic powder, and serve.\n"
    ],
    "calories": 350,
    "carb": 7,
    "protein": 47,
    "fat": 15
  },
  {
    "url": "https://www.allrecipes.com/recipe/240708/broccoli-and-chicken-stir-fry/",
    "name": "Broccoli and Chicken Stir-Fry",
    "prep": "15 Mins",
    "cook": "20 Mins",
    "ready in": "35 Mins",
    "servings": "3 servings",
    "ingredients": [
      "⅔ cup soy sauce",
      "¼ cup brown sugar",
      "½ teaspoon ground ginger",
      "1 pinch red pepper flakes, or to taste",
      "2 tablespoons water",
      "2 tablespoons cornstarch",
      "2 teaspoons vegetable oil, or to taste",
      "3 skinless, boneless chicken breast halves, cut into chunks",
      "1 onion, sliced",
      "3 cups broccoli florets"
    ],
    "directions": [
      "Stir soy sauce, brown sugar, ginger, and red pepper flakes together in a bowl to dissolve sugar into the liquid. Mix water and cornstarch together in a small bowl; stir with a whisk until cornstarch dissolves completely.\n",
      "Heat oil in a large skillet over high heat. Fry chicken and onion in hot oil until the chicken is no longer pink in the center and the onion is tender, 5 to 7 minutes. Stir broccoli with the chicken and onion; saute until the broccoli is hot, about 5 minutes. Push the chicken and vegetables mixture to the side of the skillet.\n",
      "Pour the soy sauce mixture into the vacant part of the skillet. Stir the cornstarch slurry into the soy sauce mixture until the color is consistent. Move the chicken and vegetables back into the center to the pan; saute until the sauce thickens and coats the chicken and vegetables, about 5 minutes more.\n"
    ],
    "calories": 357,
    "carb": 41,
    "protein": 34,
    "fat": 8
  },
  {
    "url": "https://www.allrecipes.com/recipe/8597/quick-and-easy-mexican-chicken/",
    "name": "Quick and Easy Mexican Chicken",
    "prep": "15 Mins",
    "cook": "25 Mins",
    "ready in": "40 Mins",
    "servings": "4 servings",
    "ingredients": [
      "4 skinless, boneless chicken breasts",
      "cooking spray",
      "1 clove garlic, minced",
      "1 pinch salt",
      "1 pinch ground black pepper",
      "1 pinch ground cumin",
      "1 cup salsa",
      "1 cup shredded Cheddar cheese"
    ],
    "directions": [
      "Preheat oven to 375 degrees F (190 degrees C).\n",
      "Heat a greased skillet to medium. Rub chicken pieces with garlic, salt, pepper and cumin to taste; place in hot skillet. Cook until brown on both sides and no longer pink, 10 to 15 minutes.\n",
      "Transfer chicken to 9x13-inch baking dish or casserole dish, top with salsa and cheese, and bake in preheated oven until cheese is bubbly and starts to brown, 15 to 20 minutes.\n"
    ],
    "calories": 265,
    "carb": 5,
    "protein": 36,
    "fat": 12
  },
  {
    "url": "https://www.allrecipes.com/recipe/82817/balsamic-glazed-salmon-fillets/",
    "name": "Balsamic-Glazed Salmon Fillets",
    "prep": "10 Mins",
    "cook": "20 Mins",
    "ready in": "30 Mins",
    "servings": "6 servings",
    "ingredients": [
      "6 (5 ounce) salmon fillets",
      "4 cloves garlic, minced",
      "1 tablespoon white wine",
      "1 tablespoon honey",
      "⅓ cup balsamic vinegar",
      "4 teaspoons Dijon mustard",
      "salt and pepper to taste",
      "1 tablespoon chopped fresh oregano"
    ],
    "directions": [
      "Preheat oven to 400 degrees F (200 degrees C). Line a baking sheet with aluminum foil, and spray with non-stick cooking spray.\n",
      "Coat a small saucepan with non-stick cooking spray. Over medium heat, cook and stir garlic until soft, about 3 minutes. Mix in white wine, honey, balsamic vinegar, mustard, and salt and pepper. Simmer, uncovered, for about 3 minutes, or until slightly thickened.\n",
      "Arrange salmon fillets on foil-lined baking sheet. Brush fillets with balsamic glaze, and sprinkle with oregano.\n",
      "Bake in preheated oven for 10 to 14 minutes, or until flesh flakes easily with a fork. Brush fillets with remaining glaze, and season with salt and pepper. Use a spatula to transfer fillets to serving platter, leaving the skin behind on the foil.\n"
    ],
    "calories": 289,
    "carb": 7,
    "protein": 29,
    "fat": 16
  },
  {
    "url": "https://www.allrecipes.com/recipe/218562/super-easy-chicken-and-dumplings/",
    "name": "Super Easy Chicken and Dumplings",
    "prep": "5 Mins",
    "cook": "15 Mins",
    "ready in": "20 Mins",
    "servings": "8 servings",
    "ingredients": [
      "2 (10.5 ounce) cans cream of chicken soup",
      "3 (14 ounce) cans chicken broth",
      "3 cups shredded cooked chicken meat",
      "2 (10 ounce) cans refrigerated biscuit dough"
    ],
    "directions": [
      "Stir the cream of chicken soup, chicken broth, and shredded chicken meat together in a large saucepan over medium-high heat until it begins to simmer. Cut each biscuit into quarters, and gently stir into the simmering soup. Reduce heat to medium-low, cover, and simmer until the biscuits are no longer doughy in the center, 10 to 15 minutes.\n"
    ],
    "calories": 401,
    "carb": 37,
    "protein": 22,
    "fat": 19
  },
  {
    "url": "https://www.allrecipes.com/recipe/261567/baked-fried-breaded-eggplant/",
    "name": "Baked 'Fried' Breaded Eggplant",
    "prep": "20 Mins",
    "cook": "20 Mins",
    "ready in": "40 Mins",
    "servings": "4 servings",
    "ingredients": [
      "olive oil, divided",
      "2 cups dry unseasoned bread crumbs",
      "½ cup grated Parmesan cheese, or more to taste",
      "¼ teaspoon garlic powder, or to taste",
      "¼ teaspoon dried oregano, or to taste",
      "¼ teaspoon dried basil, or to taste",
      "salt and ground black pepper to taste",
      "2 eggs",
      "1 splash water",
      "1 eggplant, peeled and sliced into 1/4-inch rounds"
    ],
    "directions": [
      "Preheat oven to 350 degrees F (175 degrees C). Line a baking sheet with aluminum foil; coat with about 1 teaspoon olive oil.\n",
      "Combine bread crumbs, Parmesan cheese, garlic powder, oregano, basil, salt, and pepper in a shallow dish.\n",
      "Combine eggs with a splash of water in a separate shallow dish. Coat both sides of an eggplant slice with the egg mixture. Dip eggplant slice in the bread crumb mixture to coat. Place slice onto the baking sheet. Repeat coating the remaining eggplant slices. Drizzle remaining 2 teaspoons olive oil over the breaded slices.\n",
      "Bake in the preheated oven until golden brown, 20 to 25 minutes.\n"
    ],
    "calories": 356,
    "carb": 48,
    "protein": 16,
    "fat": 12
  },
  {
    "url": "https://www.allrecipes.com/recipe/221936/quick-fish-tacos/",
    "name": "Quick Fish Tacos",
    "prep": "20 Mins",
    "cook": "15 Mins",
    "ready in": "35 Mins",
    "servings": "4 servings",
    "ingredients": [
      "¼ cup reduced-fat sour cream",
      "2 tablespoons lime juice",
      "salt and ground black pepper to taste",
      "1 jalapeno pepper, halved lengthwise",
      "2 ½ cups shredded red cabbage",
      "4 green onions, thinly sliced",
      "2 tablespoons olive oil",
      "1 pound tilapia fillets, cut into strips",
      "8 (6 inch) flour tortillas",
      "½ cup chopped fresh cilantro"
    ],
    "directions": [
      "Mix sour cream and lime juice together in a large bowl; season with salt and black pepper. Reserve about half the mixture in another bowl for serving. Mince half the jalapeno pepper; save other half for later. Toss cabbage, green onions, and minced jalapeno half in remaining sour cream mixture until slaw is well mixed.\n",
      "Heat olive oil and remaining jalapeno half in a large skillet over medium heat; swirl oil to coat skillet evenly. Season tilapia fillets with salt and pepper. Pan-fry fish strips in the skillet in 2 batches until fish is golden brown and easily flaked with a fork, 5 to 6 minutes. Discard jalapeno half.\n",
      "Heat tortillas in the microwave on high until warm, 20 to 30 seconds.\n",
      "Serve fish in warmed tortillas topped with cabbage slaw, reserved sour cream mixture, and cilantro.\n"
    ],
    "calories": 416,
    "carb": 39,
    "protein": 31,
    "fat": 16
  },
  {
    "url": "https://www.allrecipes.com/recipe/240400/skillet-chicken-bulgogi/",
    "name": "Skillet Chicken Bulgogi",
    "prep": "15 Mins",
    "cook": "15 Mins",
    "ready in": "30 Mins",
    "servings": "4 servings",
    "ingredients": [
      "¼ cup chopped onion",
      "5 tablespoons soy sauce",
      "2 ½ tablespoons brown sugar",
      "2 tablespoons minced garlic",
      "2 tablespoons sesame oil",
      "1 tablespoon sesame seeds",
      "½ teaspoon cayenne",
      "salt and ground black pepper to taste",
      "1 pound skinless, boneless chicken breasts, cut into thin strips"
    ],
    "directions": [
      "Whisk onion, soy sauce, brown sugar, garlic, sesame oil, sesame seeds, cayenne pepper, salt, and black pepper together in a bowl until marinade is smooth.\n",
      "Cook and stir chicken and marinade together in a large skillet over medium-high heat until chicken is cooked through, about 15 minutes.\n"
    ],
    "calories": 269,
    "carb": 14,
    "protein": 28,
    "fat": 12
  },
  {
    "url": "https://www.allrecipes.com/recipe/220824/maui-wowie-shrimp/",
    "name": "Maui Wowie Shrimp",
    "prep": "15 Mins",
    "cook": "10 Mins",
    "ready in": "25 Mins",
    "servings": "6 servings",
    "ingredients": [
      "2 pounds uncooked medium shrimp, peeled and deveined",
      "1 pinch garlic salt, or to taste",
      "ground black pepper to taste",
      "¼ teaspoon cayenne pepper, or to taste",
      "1 cup mayonnaise",
      "1 lemon, cut into wedges"
    ],
    "directions": [
      "Preheat outdoor grill for medium heat, and lightly oil the grate.\n",
      "Thread shrimp onto skewers. Season both sides of shrimp with garlic salt and black pepper; if using cayenne, see Cook's Note.\n",
      "Generously coat both sides of shrimp with mayonnaise.\n",
      "Cook shrimp on heated grill until shrimp are bright pink on the outside and opaque on the inside, and the mayonnaise turns golden brown, 5 to 10 minutes on each side. Serve with lemon wedges.\n"
    ],
    "calories": 381,
    "carb": 2,
    "protein": 26,
    "fat": 31
  },
  {
    "url": "https://www.allrecipes.com/recipe/24712/ginger-veggie-stir-fry/",
    "name": "Ginger Veggie Stir-Fry",
    "prep": "25 Mins",
    "cook": "15 Mins",
    "ready in": "40 Mins",
    "servings": "6 servings",
    "ingredients": [
      "1 tablespoon cornstarch",
      "1 ½ cloves garlic, crushed",
      "2 teaspoons chopped fresh ginger root, divided",
      "¼ cup vegetable oil, divided",
      "1 small head broccoli, cut into florets",
      "½ cup snow peas",
      "¾ cup julienned carrots",
      "½ cup halved green beans",
      "2 tablespoons soy sauce",
      "2 ½ tablespoons water",
      "¼ cup chopped onion",
      "½ tablespoon salt"
    ],
    "directions": [
      "In a large bowl, blend cornstarch, garlic, 1 teaspoon ginger, and 2 tablespoons vegetable oil until cornstarch is dissolved. Mix in broccoli, snow peas, carrots, and green beans, tossing to lightly coat.\n",
      "Heat remaining 2 tablespoons oil in a large skillet or wok over medium heat.  Cook vegetables in oil for 2 minutes, stirring constantly to prevent burning. Stir in soy sauce and water. Mix in onion, salt, and remaining 1 teaspoon ginger. Cook until vegetables are tender but still crisp.\n"
    ],
    "calories": 119,
    "carb": 8,
    "protein": 3,
    "fat": 10
  },
  {
    "url": "https://www.allrecipes.com/recipe/103144/balsamic-chicken/",
    "name": "Balsamic Chicken",
    "prep": "5 Mins",
    "cook": "20 Mins",
    "ready in": "45 Mins",
    "servings": "4 servings",
    "ingredients": [
      "⅓ cup balsamic vinegar",
      "½ cup chicken broth",
      "2 tablespoons white sugar",
      "1 clove garlic, minced",
      "1 teaspoon dried Italian herb seasoning",
      "4 skinless, boneless chicken breast halves",
      "1 tablespoon olive oil"
    ],
    "directions": [
      "Whisk together the balsamic vinegar, chicken broth, sugar, garlic, and Italian seasoning in a bowl, place the chicken breasts in the marinade, and marinate for 10 minutes on each side.\n",
      "Heat the olive oil in a large skillet over medium-high heat. Remove the chicken from the marinade and reserve the marinade. Place the chicken in the heated pan and cook until they start to brown and are no longer pink inside, about 7 minutes per side. Pour the marinade into the skillet, and cook until it thickens slightly, turning the chicken breasts over once or twice, about 5 minutes.\n"
    ],
    "calories": 195,
    "carb": 10,
    "protein": 27,
    "fat": 5
  },
  {
    "url": "https://www.allrecipes.com/recipe/22228/slow-cooker-roast-beef/",
    "name": "Slow Cooker Roast Beef",
    "prep": "5 Mins",
    "cook": "22 Hours 0 Mins",
    "ready in": "22 Hours 5 Mins",
    "servings": "6 servings",
    "ingredients": [
      "⅓ cup soy sauce",
      "1 (1 ounce) package dry onion soup mix",
      "3 pounds beef chuck roast",
      "2 teaspoons freshly ground black pepper"
    ],
    "directions": [
      "Pour soy sauce and dry onion soup mix into the slow cooker; mix well. Place chuck roast into the slow cooker. Add water until the top 1/2 inch of the roast is not covered. Sprinkle ground pepper on top.\n",
      "Cover and cook on low for 22 hours.\n"
    ],
    "calories": 555,
    "carb": 5,
    "protein": 41,
    "fat": 41
  },
  {
    "url": "https://www.allrecipes.com/recipe/8594/easy-chicken-casserole/",
    "name": "Easy Chicken Casserole",
    "prep": "n/a",
    "cook": "n/a",
    "ready in": "n/a",
    "servings": "4 to 5 servings",
    "ingredients": [
      "4 skinless, boneless chicken breast halves",
      "1 (10.75 ounce) can  condensed cream of chicken soup",
      "1 cup sour cream",
      "32 buttery round crackers",
      "¼ cup chopped onion",
      "¼ cup chopped mushrooms"
    ],
    "directions": [
      "Preheat oven to 350 degrees F (175 degrees C).\n",
      "Boil chicken until cooked through (no longer pink inside), about 20-30 minutes. Chop into bite size pieces and place in a 9x13 inch baking dish.\n",
      "Combine soup, sour cream, onion (optional) and mushrooms (optional). Pour mixture over chicken and top with crumbled crackers. Cover and bake at 350 degrees F (175 degrees C) for 30 minutes (or freeze for baking at another time).\n"
    ],
    "calories": 467,
    "carb": 29,
    "protein": 34,
    "fat": 24
  },
  {
    "url": "https://www.allrecipes.com/recipe/263628/best-chicken-patties/",
    "name": "Best Chicken Patties",
    "prep": "25 Mins",
    "cook": "10 Mins",
    "ready in": "35 Mins",
    "servings": "6 servings",
    "ingredients": [
      "18 ounces ground chicken",
      "1 onion, finely chopped",
      "1 bunch fresh parsley, finely chopped",
      "1 egg",
      "2 cloves garlic, crushed, or more to taste",
      "sea salt and freshly ground black pepper to taste",
      "2 tablespoons mayonnaise",
      "¼ cup all-purpose flour, or as needed",
      "3 tablespoons vegetable oil"
    ],
    "directions": [
      "Combine chicken, onion, parsley, egg, garlic, sea salt, and pepper in a bowl; mix well. Add mayonnaise and stir to combine; the mixture will be quite soft.\n",
      "Place flour in a shallow bowl. Drop large spoonfuls of the chicken mixture into the flour. Roll to coat and press gently into patties.\n",
      "Heat oil in a skillet over medium-high heat. Cook chicken patties in the hot oil until golden brown and no longer pink in the center, 5 to 7 minutes per side.\n"
    ],
    "calories": 229,
    "carb": 7,
    "protein": 22,
    "fat": 13
  },
  {
    "url": "https://www.allrecipes.com/recipe/276006/air-fryer-lobster-tails-with-lemon-garlic-butter/",
    "name": "Air Fryer Lobster Tails with Lemon-Garlic Butter",
    "prep": "10 Mins",
    "cook": "10 Mins",
    "ready in": "20 Mins",
    "servings": "2 lobster tails",
    "ingredients": [
      "2 (4 ounce) lobster tails",
      "4 tablespoons butter",
      "1 teaspoon lemon zest",
      "1 clove garlic, grated",
      "salt and ground black pepper to taste",
      "1 teaspoon chopped fresh parsley",
      "2 wedges lemon"
    ],
    "directions": [
      "Butterfly lobster tails by cutting lengthwise through the centers of the hard top shells and meat with kitchen shears. Cut to, but not through, the bottoms of the shells. Spread the tail halves apart. Place tails in the air fryer basket with lobster meat facing up.\n",
      "Melt butter in a small saucepan over medium heat. Add lemon zest and garlic; heat until garlic is tender, about 30 seconds. Transfer 2 tablespoons of butter mixture to a small bowl and brush onto lobster tails; discard any remaining brushed butter to avoid contamination from uncooked lobster. Season lobster with salt and pepper.\n",
      "Cook in an air fryer at 380 degrees F (195 degrees C) until lobster meat is opaque, 5 to 7 minutes. Spoon reserved butter from the saucepan over lobster meat. Top with parsley and serve with lemon wedges.\n"
    ],
    "calories": 313,
    "carb": 4,
    "protein": 19,
    "fat": 26
  },
  {
    "url": "https://www.allrecipes.com/recipe/284318/easy-ramen-with-chicken-and-teriyaki-sauce/",
    "name": "Easy Ramen with Chicken and Teriyaki Sauce",
    "prep": "15 Mins",
    "cook": "10 Mins",
    "ready in": "25 Mins",
    "servings": "2 servings",
    "ingredients": [
      "2 (3 ounce) packages ramen noodles (flavor packets discarded)",
      "1 tablespoon butter",
      "2 medium carrots, peeled and thinly sliced",
      "1 medium zucchini, chopped",
      "1 medium onion, chopped",
      "2 cups cooked, shredded chicken breast meat",
      "1 tablespoon teriyaki sauce, or more to taste",
      "salt and ground black pepper to taste"
    ],
    "directions": [
      "Add 4 cups water to a skillet and bring to a boil. Add ramen and cook until soft, about 5 minutes.\n",
      "Meanwhile, melt butter in another skillet over medium heat. Add carrots, zucchini, and onion and saute until vegetables have softened, about 5 minutes. Add shredded chicken, teriyaki sauce, salt, and pepper and cook until heated through and sauce has thickened, 3 to 5 minutes.\n",
      "Drain ramen and add to the vegetable and chicken mixture. Toss and add more teriyaki as needed.\n"
    ],
    "calories": 343,
    "carb": 18,
    "protein": 40,
    "fat": 13
  },
  {
    "url": "https://www.allrecipes.com/recipe/269068/honey-garlic-chicken-thighs/",
    "name": "Honey-Garlic Chicken Thighs",
    "prep": "5 Mins",
    "cook": "15 Mins",
    "ready in": "20 Mins",
    "servings": "6 chicken thighs",
    "ingredients": [
      "6 chicken thighs",
      "2 teaspoons garlic powder",
      "salt and ground black pepper to taste",
      "6 cloves garlic, crushed",
      "⅓ cup honey",
      "¼ cup water",
      "2 tablespoons rice wine vinegar",
      "1 tablespoon soy sauce"
    ],
    "directions": [
      "Season chicken with garlic powder, salt, and pepper.\n",
      "Heat a pan over medium-high heat. Add chicken and sear until golden, 10 to 12 minutes. An instant-read thermometer inserted into the centers should read at least 165 degrees F (74 degrees C). Drain most of the excess grease from the pan, leaving about 2 tablespoons behind.\n",
      "Arrange chicken thighs skin-side down in the pan. Place crushed garlic between the chicken and fry until fragrant, about 30 seconds. Add honey, water, vinegar, and soy sauce. Increase heat to medium-high and cook until sauce reduces down and thickens slightly, 3 to 4 minutes.\n"
    ],
    "calories": 244,
    "carb": 18,
    "protein": 19,
    "fat": 12
  },
  {
    "url": "https://www.allrecipes.com/recipe/245775/spaghetti-alla-carbonara-the-traditional-italian-recipe/",
    "name": "Spaghetti alla Carbonara: the Traditional Italian Recipe",
    "prep": "10 Mins",
    "cook": "15 Mins",
    "ready in": "30 Mins",
    "servings": "4 servings",
    "ingredients": [
      "2 teaspoons olive oil",
      "1 pound guanciale (cured pork cheek), diced",
      "1 (16 ounce) package spaghetti",
      "3 eggs",
      "10 tablespoons grated Pecorino Romano cheese, divided",
      "salt and ground black pepper to taste"
    ],
    "directions": [
      "Heat olive oil in a large skillet over medium heat; add guanciale (see Cook's Note). Cook, turning occasionally, until evenly browned and crispy, 5 to 10 minutes. Remove from heat and drain on paper towels.\n",
      "Bring a large pot of salted water to a boil. Cook spaghetti in the boiling water, stirring occasionally until tender yet firm to the bite, about 9 minutes. Drain and return to the pot. Let cool, stirring occasionally, about 5 minutes.\n",
      "Whisk eggs, half of the Pecorino Romano cheese, and some black pepper in a bowl until smooth and creamy. Pour egg mixture over pasta, stirring quickly, until creamy and slightly cooled. Stir in guanciale. Top with remaining Pecorino Romano cheese and more black pepper.\n"
    ],
    "calories": 764,
    "carb": 86,
    "protein": 39,
    "fat": 29
  },
  {
    "url": "https://www.allrecipes.com/recipe/230905/savory-pan-seared-tuna-steaks/",
    "name": "Savory Pan-Seared Tuna Steaks",
    "prep": "10 Mins",
    "cook": "5 Mins",
    "ready in": "35 Mins",
    "servings": "2 servings",
    "ingredients": [
      "¼ cup soy sauce",
      "¼ cup extra-virgin olive oil",
      "2 tablespoons lemon juice",
      "2 teaspoons Asian (toasted) sesame oil",
      "2 teaspoons molasses",
      "1 teaspoon cayenne pepper, or more to taste",
      "6 thin slices fresh ginger, minced",
      "2 cloves garlic, minced",
      "2 1-inch-thick tuna steaks, thawed"
    ],
    "directions": [
      "Mix soy sauce, olive oil, lemon juice, sesame oil, molasses, cayenne pepper, ginger, and garlic together in a bowl.\n",
      "Place tuna steaks in a large resealable bag or airtight container; pour marinade over steaks. Marinate steaks at room temperature for 20 minutes.\n",
      "Heat a non-stick pan over medium heat. Remove steaks from marinade and arrange in the hot pan; gently shake pan to avoid sticking. Cook approximately 1 1/2 minutes and flip. Cook other side until tuna is desired doneness, 1 to 2 more minutes. An instant-read thermometer inserted into the center should read 140 degrees F (60 degrees C).\n"
    ],
    "calories": 592,
    "carb": 12,
    "protein": 43,
    "fat": 42
  },
  {
    "url": "https://www.allrecipes.com/recipe/230382/seasoned-swai-fish-fillet/",
    "name": "Seasoned Swai Fish Fillet",
    "prep": "10 Mins",
    "cook": "15 Mins",
    "ready in": "25 Mins",
    "servings": "4 servings",
    "ingredients": [
      "cooking spray",
      "4 (4 ounce) fillets swai fish",
      "2 tablespoons margarine",
      "¼ cup dry white wine",
      "1 tablespoon lemon juice",
      "1 tablespoon chopped fresh cilantro",
      "1 teaspoon minced garlic",
      "1 teaspoon salt",
      "1 teaspoon ground black pepper",
      "1 teaspoon paprika"
    ],
    "directions": [
      "Preheat oven to 350 degrees F (175 degrees C). Spray a shallow pan or baking sheet with cooking spray.\n",
      "Place fish fillets into the prepared pan.\n",
      "Heat margarine in a saucepan over medium heat. Mix white wine, lemon juice, cilantro, garlic, salt, and black pepper into the melted margarine; simmer sauce for 2 minutes. Generously spoon sauce over fish fillets. Sprinkle fillets with paprika.\n",
      "Bake in the preheated oven until fish flakes easily with a fork, 10 to 12 minutes.\n"
    ],
    "calories": 199,
    "carb": 2,
    "protein": 17,
    "fat": 13
  },
  {
    "url": "https://www.allrecipes.com/recipe/217339/crispy-baked-walleye/",
    "name": "Crispy Baked Walleye",
    "prep": "10 Mins",
    "cook": "15 Mins",
    "ready in": "25 Mins",
    "servings": "4 servings",
    "ingredients": [
      "2 eggs",
      "1 tablespoon water",
      "⅓ cup dry bread crumbs",
      "⅓ cup instant mashed potato flakes",
      "⅓ cup grated Parmesan cheese",
      "1 teaspoon seasoned salt",
      "4 (4 ounce) fillets walleye"
    ],
    "directions": [
      "Preheat an oven to 450 degrees F (230 degrees C). Grease a baking sheet.\n",
      "Beat the eggs and water together in a bowl until smooth; set aside. Combine the bread crumbs, potato flakes, and Parmesan cheese in a separate bowl with the seasoned salt until evenly mixed. Dip the walleye fillets into the beaten egg, then press into the bread crumb mixture. Place onto the prepared baking sheet.\n",
      "Bake in the preheated oven until the fish is opaque in the center and flakes easily with a fork, 15 to 20 minutes.\n"
    ],
    "calories": 221,
    "carb": 11,
    "protein": 29,
    "fat": 7
  },
  {
    "url": "https://www.allrecipes.com/recipe/241609/pork-rub-rubbed-and-baked-pork-chops/",
    "name": "Pork Rub Rubbed and Baked Pork Chops",
    "prep": "5 Mins",
    "cook": "20 Mins",
    "ready in": "25 Mins",
    "servings": "6 chops",
    "ingredients": [
      "2 tablespoons paprika",
      "2 tablespoons white sugar",
      "1 tablespoon salt",
      "1 tablespoon ground black pepper",
      "1 tablespoon garlic powder",
      "1 tablespoon onion powder",
      "2 teaspoons cayenne pepper",
      "6 pork chops"
    ],
    "directions": [
      "Preheat oven to 450 degrees F (230 degrees C).\n",
      "Mix paprika, sugar, salt, pepper, garlic powder, onion powder, and cayenne pepper together in a wide, shallow bowl. Dredge pork chops in the spice mixture to coat and arrange on a baking sheet.\n",
      "Bake chops in preheated oven until no longer pink in the center, about 20 minutes. An instant-read thermometer inserted into the center should read 145 degrees F (63 degrees C).\n"
    ],
    "calories": 292,
    "carb": 9,
    "protein": 42,
    "fat": 10
  },
  {
    "url": "https://www.allrecipes.com/recipe/259455/instant-pot-mushroom-risotto/",
    "name": "Instant Pot&reg; Mushroom Risotto",
    "prep": "15 Mins",
    "cook": "30 Mins",
    "ready in": "50 Mins",
    "servings": "4 servings",
    "ingredients": [
      "¼ cup unsalted butter",
      "¼ cup olive oil",
      "3 cups diced mushrooms",
      "1 cup chopped onion",
      "1 sprig rosemary",
      "1 ½ cups Arborio rice",
      "¾ cup white wine",
      "1 quart chicken stock",
      "salt and ground black pepper to taste",
      "½ cup grated Parmesan cheese"
    ],
    "directions": [
      "Select the Saute function on an electric pressure cooker (such as Instant Pot&reg;). Add butter and olive oil; stir until butter melts, about 2 minutes. Add mushrooms; cook, stirring occasionally, until slightly softened, about 3 minutes. Stir in onion; cook for 2 minutes. Add rosemary sprig; cook for 1 minute.\n",
      "Stir rice into the pot until each grain is coated with butter-olive oil mixture, about 2 minutes. Pour in wine; simmer for 3 minutes. Pour in chicken stock, stirring to scrape the sides of the pot. Simmer for 1 minute.\n",
      "Close and lock the lid. Turn the venting knob to sealing. Select high pressure according to manufacturer's instructions; set timer for 6 minutes. Allow 10 to 15 minutes for pressure to build.\n",
      "Tap venting knob a few times with a wooden spoon or spatula. Stand back; turn knob to point at Vent. Remove lid when pressure is released, about 5 minutes.\n",
      "Stir risotto until creamy, about 1 minute. Discard rosemary sprig. Season with salt and pepper. Stir in Parmesan cheese until melted and combined.\n"
    ],
    "calories": 645,
    "carb": 77,
    "protein": 13,
    "fat": 29
  }
]
